[{"talk":[{"title":"Coffee break","type":"break","day":1,"track":1,"slot":"10:00","duration":20}]},{"talk":[{"title":"Coffee break","type":"break","day":1,"track":2,"slot":"10:00","duration":20}]},{"talk":[{"title":"Coffee break","type":"break","day":1,"track":3,"slot":"10:00","duration":20}]},{"talk":[{"title":"Coffee break","type":"break","day":1,"track":4,"slot":"10:00","duration":20}]},{"talk":[{"title":"Coffee break","type":"break","day":1,"track":0,"slot":"10:00","duration":20}]},{"talk":[{"title":"","type":"empty","day":1,"track":0,"slot":"10:20","duration":60}]},{"firstname":"Scott","lastname":"Amyx","pageurl":"scott-amyx","url":"https://twitter.com/amyxiot","photo":"scott amyx.jpg","company":"Amyx+McKinsey","talk":[{"tid":100,"title":"Keynote","type":"talk","short":["TBA"],"long":["TBA"],"day":1,"track":1,"slot":"09:00","duration":60}],"tags":["keynote"]},{"firstname":"Amir","lastname":"Golan","pageurl":"amir-golan","url":"https://de.linkedin.com/in/amir-golan-a0766085","photo":"Amir Golan.jpg","company":"Amazon","talk":[{"tid":105,"title":"DevOps on AWS: Deep Dive on Continuous Delivery and the AWS Developer Tools","type":"talk","short":["Continues delivery in the cloud, learn how you can automate build and test processes, that allow you to continuously deploy all code changes."],"long":["Today’s cutting-edge companies have software release cycles measured in days instead of months. This agility is enabled by the DevOps practice of continuous delivery, which automates building, testing, and deploying all code changes. This automation helps you catch bugs sooner and accelerates developer productivity. In this session, we’ll share the processes that Amazon’s engineers use to practice DevOps and discuss how you can bring these processes to your company by using a set of AWS tools (AWS CodePipeline and AWS CodeDeploy, AWS OpsWorks)."],"day":2,"track":1,"slot":"09:00","duration":60}],"tags":["devops"]},{"firstname":"John","lastname":"Vaskis","pageurl":"john-vaskis","url":"https://mobile.twitter.com/johnvaskis","photo":"John Vaskis.jpg","company":"Indiegogo","talk":[{"tid":110,"title":"How to raise a million dollars on Indiegogo","type":"talk","short":["TBA"],"long":["TBA"],"day":1,"track":2,"slot":"09:00","duration":60}],"tags":["business"]},{"firstname":"Sebastian","lastname":"Faulhaber","pageurl":"sebastian-faulhaber","url":"http://www.faulhaber.it/","photo":"Sebastian Faulhaber.jpg","company":"Red Hat","talk":[{"tid":115,"title":"Faster and more efficient processes by combining BPM and Mobile","type":"talk","short":["A lot has happened in the area of mobile since Apple kicked off the revolution by announcing the first iPhone. However, the overall mobile market still has to be considered as young and especially unstandardized. This really puts a lot of organizations in front of huge challenges concerning the efficient development of mobile applications and the secure integration into backend IT systems. - But there is no way around mobile in the next years! The smart combination of mobile techniques (mBaaS, microservices, etc.) and business process management approaches will definitely drive process efficiency and speed to a whole new level.","In this presentation I will outline the floating icebergs you should look at when implementing mobile and BPM in your enterprise. In addition to that you will learn how other companies have successfully implemented mobile to optimize their processes."],"long":["A lot has happened in the area of mobile since Apple kicked off the revolution by announcing the first iPhone. However, the overall mobile market still has to be considered as young and especially unstandardized. This really puts a lot of organizations in front of huge challenges concerning the efficient development of mobile applications and the secure integration into backend IT systems. - But there is no way around mobile in the next years! The smart combination of mobile techniques (mBaaS, microservices, etc.) and business process management approaches will definitely drive process efficiency and speed to a whole new level.","In this presentation I will outline the floating icebergs you should look at when implementing mobile and BPM in your enterprise. In addition to that you will learn how other companies have successfully implemented mobile to optimize their processes."],"day":1,"track":4,"slot":"09:00","duration":60}],"tags":null},{"firstname":"Dejan","lastname":"Bosanac","pageurl":"dejan-bosanac","url":"http://sensatic.net/about","photo":"Dejan Bosanac.jpg","company":"Red Hat","talk":[{"tid":120,"title":"Open stack for building end-to-end IoT solutions","type":"talk","short":["There's a lot of pieces needed to build a scalable IoT solution. Today most of these components exists as open source projects, which makes it easier than ever to connect large number devices to the cloud. This session will describe architecture and components of the scalable IoT solutions and open source projects that can be used to build them."],"long":["The session will start by covering the general architecture of end-to-end IoT systems and describe in more details the role of every component. Next, it will dig deeper into all the components and explain open source projects that implement them. For example, we will see what are field gateways and how Eclipse Kura project implements those functionalities. IoT server connector's role will be described next and we'll see how Eclipse Hono helps connecting devices to the cloud. Finally, we'll examine an architecture of the IoT Cloud and see what it takes to handle and manage large number of devices. We'll also see how IoT cloud will be implemented in the upcoming open source project (which should be public by the time of the session). After this session, you'll have the big picture of how to connect devices to the cloud in scalable way and what open source projects to use to achieve that."],"day":1,"track":3,"slot":"09:00","duration":60}],"tags":["iot"]},{"firstname":"Nicolas","lastname":"Fränkel","pageurl":"nicolas-frankel","url":"https://twitter.com/nicolas_frankel","photo":"Nicolas Frankel.jpg","company":"SAP","talk":[{"tid":125,"title":"Spring Boot and Kotlin, a match made in Heaven","type":"talk","short":["TBA"],"long":["TBA"],"day":1,"track":4,"slot":"10:20","duration":60}],"tags":["kotlin"]},{"firstname":"Yufeng","lastname":"Guo","pageurl":"yufeng-guo","url":"https://twitter.com/yufengg","photo":"Yufeng Guo.jpg","company":"Google","talk":[{"tid":130,"title":"Machine Learning as an API: strengths, limits, and unusual use cases","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":null},{"firstname":"Mike","lastname":"Elsmore","pageurl":"mike-elsmore","url":"https://twitter.com/ukmadlz","photo":"Mike Elsmore.jpg","company":"IBM","talk":[{"tid":135,"title":"NoSQL is a lie","type":"talk","short":["NoSQL is a term on the rise, and it's a lie. NoSQL is a catch-all term and I will point out why a catch all means missing tools that may help solve your problems. Going through a few popular DB's we will walk through the use cases and why they're good at what they do."],"long":["During the course of the talk the attendee's will be taken on a whistle stop tour of the different kinds of database that are available and why to use them.","The basic idea is to entertain people, whilst in the process make people aware that NoSQL is more than just a term. It encompasses many different technologies that all have a distinct reason to exist and provide many different solutions."]}],"tags":["db"]},{"firstname":"Victor","lastname":"Rentea","pageurl":"victor-rentea","url":"https://twitter.com/victorrentea","photo":"Victor Rentea.jpg","company":"IBM Global Business Services","talk":[{"tid":140,"title":"The Art of Clean Code","type":"talk","short":["After 10 years of hard work experience in Java Enterprise applications, I started several years ago teaching various topics that I mastered (www.victorrentea.ro). Among all these topics, by far the most important topic, that I always include in all my training sessions is 'Clean Code'. It's essential to be able to keep 'alive' 100k-2M lines of code. And I was told that this module has the biggest impact in day-to-day life of the dev.","Also, this talk will also show how a professional developer should behave in code, the 'ethics code' that ough to be followed by everyone. We will go from the most basic concerns like how should we choose our names, how should we write our functions, format and (not) comment them, to more advanced topics of true Objects. The entire presentation is spiced with numerous esay to understand examples and code snippets.","The contents of the material mainly revolves around the Clean Code boogvof Uncle Bob plus many other sourcesm"],"long":["The primary value of software is to be flexible. The secondary value of software is to do what business wants it to do.","Sounds insane? Just think a bit: what's the difference between IT and regular engineering? What propulsated IT that much? The ability to evolve, to adapt to new business needs. And we all know how difficult it is to adapt and strech old, dirty, rigid code.","Financially, the fact that 80% of the costs of a software project are in maintenance may not concern you, the developer, directly. But the fact that you read 10x times more time than you write code should make it clear to you: do your very best to write clean, beautiful code that is easy to maintain. This module explains how do such art.","Besides the bare act of writing code, the module also tackles the problematic of team work, code responsibility and cooperation necessary to any professional software engineer.","The module covers the most important practical aspects from the reference book 'Clean Code' by Robert C. Martin, along with many other sources. The training material was reviewed and discussed with numerous seniors to reach a wider consensus regarding the ideas and their nuances.","This is the module which is most likely to have the deepest impact on your day-to-day work, changing the way you exercise your profession. That's why I allways recommend to add this module to any training."," ","Agenda:"," ","• What is Clean Code","• Names","• Express intent","• Parts of speech","• Functions","• Function Size","• Extracting Method Objects","• Function Signature","• Side Effects & Temporal Coupling","• Command/Query separation","• Classes","• Basic Shape","• True Encapsulation","• Data Structures vs. True Objects","• Switch+Data Structures vs. Polymorphic Objects (opt)","• 'Tell, Don`t Ask' Principle","• Feature Envy","• The Plugin Model: Dependency Inversion (opt)","• Code Formatting","• Comments are failures"]}],"tags":["metodologies"]},{"firstname":"James","lastname":"Thomas","pageurl":"james-thomas","url":"http://jamesthom.as/","photo":"James Thomas.png","company":"IBM Bluemix","talk":[{"tid":145,"title":"Microservices Without Servers","type":"talk","short":["Developers spend too much time maintaining servers, rather than writing software. Recently, new cloud solutions, known as 'serverless' platforms, allow developers to write microservices without servers. What does a 'serverless' application look like, how do you create one and what are the challenges?","In this session, we'll introduce the 'serverless' stack, showing developers how to write microservices using these platforms. We'll look at migrating existing applications over to this new stack, common issues and challenges that you need to consider and tools to support serverless development."],"long":["Servers are killing your productivity.","Rather than building better software for your users, you end up constantly distracted by maintaining computers.","Wasn't the 'cloud' supposed to fix this? It sounded so promising until we realised it was just renting VMs in someone else's datacenter. We couldn't escape 'servers'.","Until now...","With the launch of services like AWS Lambda, Google Cloud Functions and OpenWhisk, you can now run code on the cloud without servers!","These platforms let you build stateless microservices, combining APIs with business logic, without servers. Microservices are executed on-demand, in milliseconds, rather than having to sit idle waiting for incoming requests. Users pay only for the raw computation time used.","...but how?","In this session, developers will learn how to write “microservices” for a popular serverless platform, understanding the capabilities and constraints for the platform. We’ll look at common challenges, such as handling static file hosting, exposing services as public APIs and managing application dependencies, before explaining the solutions. Exploring emerging “serverless” design patterns will give developers the knowledge to build application architectures using these new platforms.","This session is aimed at software developers experienced in building traditional backend web applications, who want to learn how to build microservices without servers.","If you’re spending too much time managing computers, rather than writing software, come to this session to learn how to banish your servers from application development forever!"]}],"tags":["microservices"]},{"firstname":"Adam","lastname":"Hynes","pageurl":"adam-hynes","url":"https://au.linkedin.com/in/adamhynes","photo":"Adam Hynes.jpg","company":"Atlassian","talk":[{"tid":150,"title":"Don`t be left out: How to develop software in a distributed team","type":"talk","short":["Working with a team on the other side of the world can be a lonely, frustrating experience. But with the right attitude, practices, and tools, it could just be the most effective way to build software with others. Learn how I moved to the other side of the world and stayed productive without changing teams."],"long":["Working with a team on the other side of the world can be a lonely, frustrating experience. But with the right attitude, practices, and tools, it could just be the most effective way to build software with others. Learn how I moved to the other side of the world and stayed productive without changing teams.","In this talk, you’ll learn about the joy of having all your code reviewed while you sleep. You’ll learn of the pain of waiting for a whole day for an answer to an important question. But above all, you’ll learn what you need to do to be able to work productively when your team is ten long hours away.","See how I use tools such as Floobits for real-time remote pairing, and HipChat for asynchronous stand-ups to keep the team on the same page across timezones."]}],"tags":["distributed systems"]},{"firstname":"Viktor","lastname":"Farcic","pageurl":"viktor-farcic","url":"https://technologyconversations.com/about/","photo":"Viktor Farcic.jpg","company":"CloudBees","talk":[{"tid":155,"title":"Self-Healing Systems","type":"talk","short":["We'll explore practices and tools required to set up fully autonomous self-healing systems capable of both reactive recuperation from failures and proactive predictions of steps that should be taken to prevent failures before they happen."],"long":["We can think of the whole computer systems like a human body that consist of cells of various types. They can be hardware or software. When they are software units, the smaller they are, the easier it is for them to self-heal, recuperate from failures, multiply or even get destroyed when that is needed. We call those small units microservices, and they can indeed have behaviours similar to those observed in a human body.  Microservices-based systems can be made in a way that they have the ability to self-heal. That is not to say that self-healing we are about to explore is applicable only to microservices. It is not. However, self-healing can be applied to almost any type of the architecture but provides best results when combined with microservices.","We'll explore practices and tools required to set up fully autonomous self-healing systems capable of both reactive recuperation from failures and proactive predictions of steps that should be taken to prevent failures before they happen."]},{"tid":160,"title":"Microservices Lifecycle Workshop","type":"workshop","short":["This workshop will go through the whole microservices development lifecycle. We'll start from the very beginning. We'll define and design architecture. From there on we'll move from requirements, technological choices and development environment setup, through coding and testing all the way until the final deployment to production. We won't stop there. Once our new services are up and running we'll see how to maintain them, scale them depending on resource utilization and response time, recuperate them in case of failures and create central monitoring and notifications system. We'll try to balance the need for creative manual work and the need to automate as much of the process as possible."],"long":["Microservices are becoming more and more popular and, as with every other new trend, often implemented without enough experience. Idea behind them is easy to explain. Brake monolithic application into smaller independent services. That's it. That is what many think microservices are about. However, implementation is much harder to master. There are many things to consider when embarking down this path. How do we organize microservices? Which technologies to use and how? Should they be mutable or not? How to test them? How to deploy them? How to create scalable and fault tolerant systems? Self-healing, zero-downtime and logging? How should the teams be organized? Today's successful implementations of microservices require all those and many other questions to be answered. It's not only about splitting things into smaller pieces. The whole development ecosystem needs to be changed and we need to take a hard look at the microservices development lifecycle.","This workshop will go through the whole microservices development lifecycle. We'll start from the very beginning. We'll define and design architecture. From there on we'll move from requirements, technological choices and development environment setup, through coding and testing all the way until the final deployment to production. We won't stop there. Once our new services are up and running we'll see how to maintain them, scale them depending on resource utilization and response time, recuperate them in case of failures and create central monitoring and notifications system. We'll try to balance the need for creative manual work and the need to automate as much of the process as possible.","This will be a journey through all the aspects of the lives of microservices and everything that surrounds them. We'll see how microservices fit into continuous deployment and immutable containers concepts and why the best results are obtained when those three are combined into one unique framework.","During the workshop we'll explore tools like Docker, Docker Swarm, Docker Compose, Ansible, Consul, etcd, confd, Registrator, nginx, HAProxy, ElasticSearch, LogStash, Kibana, and so on."]}],"tags":["microservices","docker"]},{"firstname":"Mark","lastname":"Heckler","pageurl":"mark-heckler","url":"","photo":"Mark Heckler.jpg","company":"Pivotal Software, Inc.","talk":[{"tid":165,"title":"This stuff is cool, but HOW CAN I GET MY COMPANY TO DO IT? Businessing the S*** out of Transformative Development!","type":"talk","short":["Cloud Native, containers, DevOps, microservices, etc.: we go to conferences & get excited about things that could revolutionize our development & change our organizational & professional lives! And then, we go home...and hit the wall. If you've ever asked yourself, 'This stuff is cool, but HOW CAN I GET MY COMPANY TO DO IT??!', this is the session for you.","Learn from an experienced software developer (who also happens to have an MBA) how to make your case to leadership, presenting management-ready justifications for changes in 'your world' that will positively impact the business as a whole."],"long":["Cloud Native, containers, DevOps, microservices, and more: we go to conferences and get excited about the potential of so many things that could revolutionize our development and change our organizational and professional lives! And then, we go home...and hit the wall. If you've ever asked yourself, 'This stuff is cool, but HOW CAN I GET MY COMPANY TO DO IT??!', this is the session for you.","Learn from an experienced software developer (who also happens to have an MBA) how to make your case to leadership, presenting management-ready justifications for changes in 'your world' that will positively impact the business as a whole. Topics include:"," ","• How would this change affect your organization's/group's/team's work?","• How would this change impact (positively and negatively) your tech stack (internal considerations)?","• How would this change contribute to recruitment/retention (external considerations)?","• Seeing beyond your borders: how could this change positively - and negatively - affect the business?","• Putting numbers with it: pros, cons, and caveats"," ","Come to this session to dramatically boost your chances of making an actual, positive change to your organization!"]}],"tags":["metodologies"]},{"firstname":"Stéphane","lastname":"Nicoll","pageurl":"stephane-nicoll","url":"","photo":"Stephane Nicoll.jpg","company":"Pivotal","talk":[{"tid":170,"title":"From Zero to Hero With Spring Boot","type":"talk","short":["Spring Boot, the new convention-over-configuration centric framework from the Spring team at Pivotal, marries Spring's flexibility with conventional, common sense defaults to make application development move swiftly and enjoyable.","It's ideally suited for building microservices and distributed systems and makes streamlining devops practices simple.","Join Spring Boot committer Stéphane Nicoll for a look at what Spring Boot is, why it's turning heads, why you should consider it for your next application (REST, web, batch, big-data, integration, whatever!) and how to get started."],"long":["Spring Boot, the new convention-over-configuration centric framework from the Spring team at Pivotal, marries Spring's flexibility with conventional, common sense defaults to make application development move swiftly and enjoyable.","It's ideally suited for building microservices and distributed systems and makes streamlining devops practices simple.","Join Spring Boot committer Stéphane Nicoll for a look at what Spring Boot is, why it's turning heads, why you should consider it for your next application (REST, web, batch, big-data, integration, whatever!) and how to get started.","This is a live coding session only.","A passive knowledge of Spring Framework is preferable though not mandatory. The purpose of this talk is to implement a simple demo app and demonstrates how Spring Boot helps you to be productive and the devops-related features it brings."]},{"tid":175,"title":"40 Tips & Tricks for Spring in IntelliJ IDEA","type":"talk","secondspeaker":"Yann Cebron","short":["Learn the best tricks directly from the developers of Spring Boot/IntelliJ IDEA. Live coding ahead!"],"long":["IDEs can be powerful, but hard to learn. Some features are hidden or simply not well known.","Let’s end this dilemma and make you more productive and efficient when working on Spring applications.","Learn how to navigate, edit and perform refactorings across a variety of common Spring technologies. You’ll leave this session with a whole stack of power tricks - right from the developers working on it."]}],"tags":["java"]},{"firstname":"Yann","lastname":"Cebron","pageurl":"yann-cebron","url":"https://about.me/yanncebron","photo":"Yann Cebron.jpg","company":"JetBrains","talk":[{"tid":180,"title":"40 Tips & Tricks for Spring in IntelliJ IDEA","type":"talk","secondspeaker":"Stéphane Nicoll","short":["Learn the best tricks directly from the developers of Spring Boot/IntelliJ IDEA. Live coding ahead!"],"long":["IDEs can be powerful, but hard to learn. Some features are hidden or simply not well known.","Let’s end this dilemma and make you more productive and efficient when working on Spring applications.","Learn how to navigate, edit and perform refactorings across a variety of common Spring technologies. You’ll leave this session with a whole stack of power tricks - right from the developers working on it."]}],"tags":["tooling"]},{"firstname":"Luis","lastname":"Mineiro","pageurl":"luis-mineiro","url":"","photo":"Luis Mineiro.jpg","company":"Zalando","talk":[{"tid":185,"title":"The frontend taboo: a story of full stack microservices","type":"talk","short":["Microservices are not news anymore. They allow multiple teams to work autonomously by choosing their own technology stacks and having their own release cycles. There is something not being addressed though, like if it is some kind of dirty little secret, and that is frontend development. The common practice for building websites remains 'the monolith': a single frontend codebase that consumes multiple APIs. We believe we found a better solution."],"long":["Microservices are not news anymore. They allow multiple teams to work autonomously by choosing their own technology stacks and having their own release cycles. There is something not being addressed though, like if it is some kind of dirty little secret, and that is frontend development. The common practice for building websites remains 'the monolith': a single frontend codebase that consumes multiple APIs. We believe we found a better solution.","Last year, a handful of Zalando engineers came up with an innovative solution for this exact problem - project Mosaic. Mosaic is a new architecture for websites where microservices are used in the entire stack, all the way to the frontend.","We’ve published Mosaic as open source. Its main components are:","- Skipper - an HTTP router with runtime update of routes","- Tailor - a streaming layout service with runtime update of templates","The network is the glue putting it all together.","In this talk we want to share our motivation to build Mosaic, how to perform such migration without downtime, and the advantages it has to offer to other organizations, regardless of their size.","We'll go through the operational details about Skipper and how it can be customized to answer many other different requirements. I'll also describe in detail how Tailor can dramatically improve the perceived performance of your website by streaming frontend content, from multiple fragments, in parallel."]}],"tags":["microservices"]},{"firstname":"Aimone","lastname":"Bodini","pageurl":"aimone-bodini","url":"https://www.linkedin.com/in/aimone-bodini-7a05b5a6","photo":"Aimone Bodini.jpg","company":"Bully! Entertainment","talk":[{"tid":190,"title":"Narrative Language of Virtual Reality","type":"talk","short":["VR is not just a 'cutting edge technology' but also a medium capable to immerse the viewer/player in another dimension and convey strong emotions. How to do so in the right way? Which techniques and tools content creators can use to convey such feelings? If the cinematic medium has a 'language', what's about VR? How to create contents with awareness?"],"long":["Since Virtual Reality is still a developing concept, we are at that stage I would call the 'democratization of the discovery.' Everyone could have access to this technology and all could potentially contribute to its accomplishment. I, therefore, felt an urge to be involved with this project, trying to explore some of the aspects of this new and exciting technological breakthrough. However, the entertainment aspect of Virtual Reality, especially the way it allows storytelling is what attracts me the most to this product. That said if you tell a story as though you would in the film, you would soon meet problems, which would raise doubts and queries. It seems that applying the general audio-visual ‘rules’ achieved whilst watching a film or any other audio-visual content is not possible. One must take into consideration new factors which require ample research focused on studying and synthesizing a new language, a language that is specific and adequate to VR technology.","This paper, therefore, aims to explore as deeply as possible, with the entail means and limitations, what are the ‘semantic factors’, the ‘vocabulary’, the ‘techniques’ that can elevate VR from just an advanced technological product to a real communication means. To do this, it was necessary to keep in mind the language closest to that of VR, the cinematic one. Thanks to the use of specific texts, alongside the knowledge in the appearance of audio-visual content acquired both through my academic career and through literature, it was possible to decipher the language used in VR, often comparing it to the one used in film. It was necessary to determine which 'words' you could translate into Virtual Reality directly, the ones which needed adjustments and finally the words which ultimately could not be translated at all. ","In parallel to this translation, it was also crucial to pay close attention to all the features that made Virtual Reality a means of communication in its own right, those factors that characterized VR and gave it an identity of its own. It was further important to ‘test’ a large number of experiences currently available to understand what these various creators of VR experiences did to convey certain emotions and meanings to their audience. In the same way, it’s been extremely useful to listen and see what these c reators expressed during the main events focused on VR like the ‘Oculus Connect’ and ‘SVVR Expo’, thanks to video sharing platforms like YouTube. Support from the study Bully! Entertainment was essential. It allowed me to use all their equipment at the forefront of Virtual Reality and at the same time gave me the opportunity to ￼5 “Narrative Language of Virtual Reality” Aimone Bodini analyze qualitatively VR experiences through the exchange of opinions and thoughts with professionals within the studio. ","This research is divided into two main parts. Initially, the reader is given an introduction to the historical context of VR, briefly explaining the advancements in this technology to date as well as introducing the key figures within this field. The first part analyzes the literature available, explaining the methodology of this research and the tools that will be used to define VR language. The second part starts with a brief explanation of the human eye, how stereoscopy works, defining what is the field of view and how these features are fundamental for VR. Subsequently, the focus will shift towards the main feature of VR, or the so-called sense of 'presence' explaining the meaning and requirements necessary to create it. ","The relationship with characters in Virtual Reality must also be understood and is discussed throughout as it changes the relationship that they establish with the audience is different to that through mediums such as literature or cinema. Exploring how editing works in this field is also detrimental to understanding what can be translated from the cinematic field and where new ways must be devised in terms of “Cutting” that VR allows. The technology specific to VR is also described, in terms of both the 3 and 6 degrees of freedom, as well as explaining how it can be used creatively for narrative purposes from editing to interacting with the environment and characters. The exploration of this newly discovered language that the world hides behind single details and this topic of research requires much broader and deeper research that what was initially thought. What has been explored here is a first step in decoding the narrative language in Virtual Reality, which just scraped the tip of the iceberg. This is an important step in encouraging other researchers and scholars to demystify this area. Overall, this research is proof that VR has a language of its own and demonstrates that the knowledge of this language is fundamental to convey the correct emotions and to fully immerse the user in Virtual Reality. "]}],"tags":null},{"firstname":"Alexey","lastname":"Buzdin","pageurl":"alexey-buzdin","url":"https://twitter.com/@AlexeyBuzdin","photo":"Alexey Buzdin.png","company":"C.T.Co","talk":[{"tid":195,"title":"Automate the Mobile","type":"talk","short":["If you are starting serious with Mobile development for multiple platforms you need to have a plan! Let's discuss what could you use to setup a Mobile Infrastructure Landscape."],"long":["TBA"]}],"tags":["mobile"]},{"firstname":"Chris","lastname":"van Beek","pageurl":"chris-van-beek","url":"https://arnhem.luminis.eu/","photo":"Chris van Beek.jpg","company":"Luminis","talk":[{"tid":200,"title":"Angular, Typescript and RequireJS: The great alltogether","type":"talk","short":["When you are doing front-end web development, three technologies are currently very hot! On top of that they seem to be made for each other.","You will come across AngularJS to structure your application logically, do databinding and create a responsive single page application.","RequireJS is used to do lazy loading of JavaScript files and to get some much needed dependency management within JavaScript. But RequireJS and JavaScript can be very complex. JavaScript is not a very simple language to write your logic in! It is not object oriented, it is weakly typed and it has lot of strange language constructs!","Typescript is a new scripting language based on ECMA 6. It will give you true object orientation, strong typing and built in support for modules with RequireJS. And it compiles to just JavaScript so it runs in any browser!","In this session I will explain how we used Angluar, TypeScript and RequireJs to create interactive web applications. You will learn how these three technologies work together and I will explain our best practices when building these front-ends. Iwill be showing some of our real life applications to explain the different concepts."],"long":["When you are doing front-end web development, three technologies are currently very hot! On top of that they seem to be made for each other.","You will come across AngularJS to structure your application logically, do databinding and create a responsive single page application.","RequireJS is used to do lazy loading of JavaScript files and to get some much needed dependency management within JavaScript. But RequireJS and JavaScript can be very complex. JavaScript is not a very simple language to write your logic in! It is not object oriented, it is weakly typed and it has lot of strange language constructs!","Typescript is a new scripting language based on ECMA 6. It will give you true object orientation, strong typing and built in support for modules with RequireJS. And it compiles to just JavaScript so it runs in any browser!","In this session I will explain how we used Angluar, TypeScript and RequireJs to create interactive web applications. You will learn how these three technologies work together and I will explain our best practices when building these front-ends. Iwill be showing some of our real life applications to explain the different concepts."]}],"tags":["javascript"]},{"firstname":"Chris","lastname":"Ward","pageurl":"chris-ward","url":"http://gregariousmammal.com/","photo":"Chris Ward.jpg","company":"Gregarious Mammal","talk":[{"tid":205,"title":"Your Favourite New Language - The Future of Swift","type":"talk","short":["Whilst open sourcing a language is nothing new, Apple's unprecedented step has caused massive excitement and activity for this new language, with a flurry of development and contributions.","In this presentation I would like to explore the current potential of Swift and what's going to be possible in the future."],"long":["Whilst open sourcing a language is nothing new, Apple's unprecedented step has caused massive excitement and activity for this new language, with a flurry of development and contributions.","In this presentation I would like to explore the current potential of Swift and what's going to be possible in the future.","I will cover:","• What can be accomplished with 'open' Swift","• What's missing from 'open' Swift","• Back end Swift and MVC","• Swift on non-Mac desktops","• Swift on non-iOS mobile devices","• Extending Swift","• What's next?"]}],"tags":["ios","mobile"]},{"firstname":"Daniel","lastname":"Siegel","pageurl":"daniel-siegel","url":"","photo":"Daniel Siegel.png","company":"Daniel G. Siegel","talk":[{"tid":210,"title":"The lost medium","type":"talk","short":["From the handaxe to the light bulb, the wheel to the car, the printing press to the television: all these tools and media have changed our world thoroughly. And not only that, but also how we interact with the world. The computer brings us into a unique position to have an impact that lasts longer than only the next iteration of a new technology. What happens when we see ourselves not only as developers and designers, but reconsider the interaction between people and computers in general?"],"long":["We are 50 years into the computer revolution, at what feels like our moment of greatest progress. There is technology easily worth one million dollars in a smartphone. The phone, calculators, cameras, games, music and video players. All of which at the date of release have cost more than a phone itself, when it first entered the market. Today's ubiquitous graphical user interface has its roots in concepts dating back to the mid-'60s. These concepts were then further developed at XEROX Parc in the '70s, and successfully commercialized in the Apple Macintosh in the early '80s, whereupon they essentially froze. ","Now, despite thousand-fold improvements along every technological dimension, the concepts behind today's interfaces are almost identical to those in the initial Mac. This talk will focus on these ideas and try to convey the computer as a new medium, similar as the printing press, the radio, the TV and the car are and were. ","To make progress as humanity we have to focus on media and tools will have an impact that lasts longer than the next iteration of a new technology. Marshall McLuhan once famously said 'we shape our tools and thereafter our tools shape us'. We have to start shaping our tools - the computer - and tackle problems such as collaboration, invent better principles than pencil and paper thinking and have to come up with better paradigms. Otherwise, we will not shape our tools - they will shape us. "]}],"tags":["ai","ux/ui"]},{"firstname":"David","lastname":"Pichsenmeister","pageurl":"david-pichsenmeister","url":"","photo":"David Pichsenmeister.jpg","company":"Orat.io","talk":[{"tid":215,"title":"Chatbots as new apps for mobile messengers","type":"talk","short":["Chatbots will be one of the next big evolutions of mobile messengers and they are changing the way how users interact with a service. I will give an overview on existing messenger and chatbot platforms and how they differentiate from each other, not only in terms of technical specifications but also in terms of which different UI elements they are providing to enrich the communication within a messenger."],"long":["Messengers now have an incredible reach and in 2015 messaging apps have overtaken social networks to become the dominant platforms on mobile phones. Chatbots will be one of the next big evolutions of mobile messengers and they are changing the way how users interact with a service. People are downloading fewer apps, and bots within messengers are quickly becoming a new way to enrich these platforms with context from outside. Messengers like WeChat already showed how to build a truly mobile platform with a pioneering model of 'apps within an app'. Adding a chatbot has a way lower barrier for users, since there’s no need to go to an appstore and download an app, it can just be added as a contact. This is super effective for lower-frequency but important services like managing credit card statements, utility bills or recurring shop orders. For these use cases, chatbots are a perfect fit since adding the bot is extremely lightweight instead of downloading a separate native full-featured apps.","Chatbots unify the UI and the interaction with a service even more than mobile apps do. They have the potential to be easier to use and learnings to be transferred from one to the other. Users do not have to learn the UI from scratch because they are already familiar with the core UI and interaction concepts from chatting with other people.","This talk is an overview on existing messenger and messenger bot platforms, how they differentiate from each other, not only in terms of technical specifications but also in terms of which different UI elements they are providing to enrich the communication within a messenger. Furthermore I will provide best practices and personal experiences for developing and building chatbots from a technical point of view as well as for designing a great user experience within a messaging app."]}],"tags":["ux/ui"]},{"firstname":"Deepak","lastname":"Nadig","pageurl":"deepak-nadig","url":"https://mobile.twitter.com/deepak_nadig","photo":"Deepak Nadig.jpg","company":"Intuit","talk":[{"tid":220,"title":"Journey to APIs and Microservices: Best practices from successful transformations","type":"talk","short":["To survive today, companies are asking themselves ‘How can we be more agile in meeting customer needs?’ Wikipedia defines Agility as “The capability of rapidly and cost efficiently adapting to changes”. Gartner defines Agility as “The ability of an organization to sense environment change and to respond efficiently and effectively to it”."],"long":["To survive today, companies are asking themselves ‘How can we be more agile in meeting customer needs?’ Wikipedia defines Agility as “The capability of rapidly and cost efficiently adapting to changes”. Gartner defines Agility as “The ability of an organization to sense environment change and to respond efficiently and effectively to it”.","Agility is enabled by systems that are flexible and extensible. ","IEEE Standard Glossary of Software Engineering Technology defines Flexibility as the ease with which a system or component can be modified for use in applications or environments other than those for which it was specifically designed. and Extensibility as the ease with which a system or component can be modified to increase its functional capacity.","As customer needs evolve, flexibility helps with composing features and applications rapidly from using API, and extensibility helps in introducing the required changes quickly by making changes in services.","The challenge many companies have today is that they have built systems primarily as monoliths during a stage of their evolution, or have several services but they are tightly coupled. Satisfying a customer need even though the functionality already exists can take significant effort and cost.","Companies are therefore moving to APIs and microservices to address this business imperative. While many initiate this journey, most of them don’t end up with the intended outcomes - they falter or fail and go through many iterations.","This talk will share principles, best practices and approaches - across architecture, organizational and cultural - that have been applied in transforming companies such as eBay and PayPal to APIs and Microservices."]}],"tags":["microservices"]},{"firstname":"Daniel","lastname":"Lebrero","pageurl":"daniel-lebrero","url":"https://labs.ig.com/blog/2670","photo":"Daniel Lebrero Berna.jpg","company":"IG Index","talk":[{"tid":225,"title":"Repl Driven Development","type":"talk","short":["Drinking too much coffee while maven builds and deploys your service? Jealous of how your FrontEnd mate just press F5 to 'deploy' his/her changes? Mastered the red-green-refactor workflow and want to know what is the next step? Our Lisp grandfathers knew how invaluable was the immediate feedback that a Read-Eval-Print Loop (REPL) allowed during development and now Java 9 will have one. Perhaps you have read that a REPL is useful for 'playing around' or for 'small code snippets', but this is far from true. In this presentation, you will learn how with a REPL you can have a better and more productive developer workflow by building a Tomcat service, one bit at a time, without having to build, compile, package or deploy it. Demo will be done with a Clojure REPL but no previous experience with Clojure is needed."],"long":["The motivation of the presentation is to show that in the JVM we do not need to suffer from the long code/build/deploy cycle when developing. Using TDD somehow ease the pain as the number of times that you need to recompile/repackage/redeploy as often, but there are still lots of code/configuration that cannot be tested unless you start the whole application. Also to be able to do TDD, you first need to understand how APIs (libraries/restful services) will behave and what kind of data they will return. The presentation will demo how with a REPL you can help with: * Build a full application a bit at a time, without having to recompile, repackage or redeploy it. * Understand libraries. * Explore existing databases and http services. * Improve the TDD workflow. * Inspect the state of a running application. * Debug in staging or even production environments. The presentation will be mostly a live coding demo with few slides. Coding will be done in Clojure, but the presentation will focus on the workflow that a REPL allows. "]}]},{"firstname":"Liviu","lastname":"Costea","pageurl":"liviu-costea","url":"https://twitter.com/@clm160","photo":"Liviu Costea.jpg","company":"BizPro Technologies","talk":[{"tid":230,"title":"Edge Performance with In-memory NoSQL","type":"talk","short":["First we started with memcache, the veteran of in-memory NoSQL. Our goal was always auto scaling on AWS and that's when we started using Redis, around 2 years ago, and it has our session, cached items and static data. But then we had bigger needs and for those we recently discovered Aerospike."],"long":["We are going to talk about in-memory NoSQL databases and how they can integrate in your current architecture in order to deliver high performance applications to your users. These can be used as session storage, a cache or a real database. We will talk at least about Memcache (the veteran), Redis (the mature) and Aerospike (the new guy), see where they excel and how you can add them to your existing stack."]}],"tags":["db"]},{"firstname":"Filip","lastname":"Danić","pageurl":"filip-danic","url":"https://twitter.com/@DanicFilip","photo":"Filip Danic.jpg","company":"SpiceFactory","talk":[{"tid":235,"title":"Complex State Handling in Modern Web Applications","type":"talk","short":["Flux architectures and why you should care. How to tame the application state and not go bananas. Examples from production applications with React.js and Redux."],"long":[" Flux architectures and why you should care. How to tame the application state and not go bananas. Examples from production applications with React.js and Redux. This talk will go into details of the problems that modern application face. How to handle dozen components running on multiple screens at the same time and handling it's own state. "]}],"tags":["web"]},{"firstname":"Grace","lastname":"Chang","pageurl":"grace-chang","url":"https://twitter.com/@greyschale","photo":"Grace Chang.png","company":"Yammer","talk":[{"tid":240,"title":"Herding Cats to a Firefight: The evolution of an engineering on-call team","type":"talk","short":["Production issues aren't an easy thing to learn to deal with. Yammer went from having one person on-call, to having the whole engineering team taking ownership of their code and services in production. This talk goes over what things worked, and what didn't, to get us there."],"long":["Your organisation has grown from a small and scrappy app to a full-fledged SaaS behemoth. It's 3AM on a Friday night (or is it Saturday?) and things are looking bad. Servers are on fire, exceptions are flooding the logs, and your customers are taking their frustration to Twitter. What do you do?","Every company that succeeds (and that's what we're all aiming for, right?) will have to solve this problem eventually. We'll talk about how Yammer evolved from having just a single person as 'the' on-call engineer, to a cross-geo follow-the-sun on-call team that satisfies customer needs, meets Microsoft standards, and doesn't kill engineers. You'll leave this talk with tips on what worked and what didn’t, to help you build this process for your team."]}],"tags":["web"]},{"firstname":"Gerard","lastname":"Sans","pageurl":"gerard-sans","url":"https://medium.com/@gerard.sans","photo":"Gerard Sans.jpg","company":"Angular GDE","talk":[{"tid":245,"title":"Building Cross-Platform Apps using Redux with Angular 2","type":"talk","short":["In this talk we are going to use a basic application to showcase Redux while using Angular 2 across different platforms (web, mobile and desktop)."],"long":["Redux has proved very successful. Inspired by Flux and Elm, is used to handle Application state and bind it to the User Interface.","Angular 2 has shifted from being just a framework to being a cross platform. This talk shows how everything fits together in this new paradigm."]},{"tid":250,"title":"Angular 2 Workshop","type":"workshop","short":["Angular 2 is a revolutionary development platform for creating applications using modern web standards and powered by the Open Source Community following the success of AngularJS."],"long":["Angular 2 introduces some major improvements over its predecessor. We are going to cover the main areas so you can start creating your own projects and enjoy its benefits Today.","Outline:","• Introduction to Angular 2","• ES5, ES6 and TypeScript","• Dependency Injection","• Templating","• Components","• Reactive Extensions","• HTTP module","• Component Router","• Forms","• Unit Testing","• Migration to Angular 2"]}],"tags":["javascript"]},{"firstname":"Hakan","lastname":"Saglam","pageurl":"hakan-saglam","url":"https://twitter.com/hakansaglam","photo":"Hakan Saglam.jpg","company":"PeakGames","talk":[{"tid":255,"title":"Getting Started Game Development with Unity as an iOS Developer","type":"talk","short":["At Peak Games, after developing 10+ iOS games natively, we have started to use Unity3D for the new games and develop 5 cross platform games so far. Unity3D has some very fundamental changes according to iOS platforms. And we have learnt a lot in this process. I want to share these experience from an iOS Developer point of view."],"long":["At Peak Games, after developing 10+ iOS games natively, we have started to use Unity3D for the new games and develop 5 cross platform games so far. Unity3D has some very fundamental changes according to iOS platforms. And we have learnt a lot in this process. I want to share these experience from an iOS Developer point of view. So as an iOS game developer I want to point out how to start working with Unity, best practices, tips and tricks to develop apps for iOS/tvOS (and also Android) devices. I am planning to cover these topics including demos/hands-on coding: * Development Process (Coding, Debugging, Testing, Profiling…) * Unit and Integration Testing * Network Management * Memory Management * Multi-Threaded Development * Integration with Native Libraries (StoreKit, CoreLocation…) * Integration with Platforms "]}],"tags":["ios","game"]},{"firstname":"Ilija","lastname":"Studen","pageurl":"ilija-studen","url":"https://twitter.com/istdn","photo":"Ilija Studen.jpg","company":"ActiveCollab","talk":[{"tid":260,"title":"Our take on agile","type":"talk","short":["Agile is about being agile, and willing to change, not about following any methodology in particular. This talk is about our process, how it evolves, what its current state is and which results did we get so far."],"long":["Lowercase 'a' in agile? Blasphemy! Not really. Agile is about being agile, and willing to change, not about following any methodology in particular. During this presentation we'll talk about our process, how we adopted lean thinking over Scrum or any other 'instant' process, and managed to shorten time to market 2x for big features in two latest iterations. Best part is that it keeps getting shorter with each iteration. A big feature used to take us 45 days to develop. Releasing a feature of equivalent complexity now takes about three weeks on average. This is from the start until the moment a finished product is available to the customer (only DoD that matters to us). It includes kick-off, development, testing, code review, documentation, staging, release and announcement. From our perspective, that’s a 100% increase in productivity. We accomplished it with the same resources and people - the only difference being constant retrospectives and improvement of the way we work."]}],"tags":["agile"]},{"firstname":"Jacek","lastname":"Kunicki","pageurl":"jacek-kunicki","url":"http://blog.kunicki.org/","photo":"Jacek Kunicki.jpg","company":"SoftwareMill","talk":[{"tid":265,"title":"Reactive Database Mapping with Scala and Slick","type":"talk","short":["Are you familiar with Object-Relational Mapping? Let's get out of the comfort zone and meet a completely different approach to mapping database tables to domain objects using Scala's Slick library during this no-fluff-just-code live-coding session."],"long":["Are you familiar with Object-Relational Mapping? Let's get out of the  comfort zone and meet a completely different approach to mapping database tables to domain objects using Scala's Slick library during this no-fluff-just-code live-coding session.","Slick does what some call FRM, i.e. Functional-Relational Mapping (as opposed to ORM), which basically lets you access your relational database as if it was a Scala collection.","And since reactive is THE way to go nowadays, we' re going to be no different."]}],"tags":["db","scala"]},{"firstname":"Jakub","lastname":"Korab","pageurl":"jakub-korab","url":"http://jakubkorab.net/","photo":"Jakub Korab.jpg","company":"Ameliant","talk":[{"tid":270,"title":"The Myth of the Magical Messaging Fabric","type":"talk","short":["To most developers messaging systems are disregarded as 'just a pipe'. Without understanding the reasoning behind them and the underlying design decision, we are frustrated by how we think they should work in production. In this session we will compare and contrast Apache ActiveMQ and Apache Kafka, and how their designs address message distribution, reliability, scalability, and performance."],"long":["TBA"]}],"tags":null},{"firstname":"Jezen","lastname":"Thomas","pageurl":"jezen-thomas","url":"","photo":"Jezen Thomas.jpg","company":"","talk":[{"tid":275,"title":"Haskell On Rails","type":"talk","short":["My talk will be about my motivations for wanting smarter tools and how the current TDD & Software Craftsmanship best practices place the onus on the developer to be disciplined, whereas humans will never be as disciplined and rigorous as machines. I'll talk about the Nix ecosystem and Haskell's ‘Yesod’ web framework, which is somewhat similar to Ruby on Rails. Audience will be inspired to try out Haskell and Nix"],"long":["For years, Ruby on Rails has been the web application framework of choice for software developers who need to *Get Things Done*. We can rapidly prototype, and then effortlessly ship. But what happens when the complexity of the system inevitably grows? We write tests, and more tests, and even more tests, and still we're on our knees, fighting fires and debugging. We need better tools. We need our machines to automatically verify the fundamental correctness of our systems. These tools have been around for a while, but until recently the 'Getting Started' material has been thin on the ground. In this talk I will show you how to get up and running and ready to build stuff with a Rails-like framework underpinned by one of the fastest and most stable languages in the industry: Haskell. The talk will cover everything from setting up a development environment, to integrating with a database and deploying to a VPS. Although this is a Haskell talk, it's from an angle of pragmatism and not academia. You do not need to know Haskell to enjoy this talk. "]}],"tags":["haskell"]},{"firstname":"Jaroslaw","lastname":"Ratajski","pageurl":"jaroslaw-ratajski","url":"https://www.facebook.com/jarek.ratajski","photo":"Jaroslaw Ratajski.png","company":"CSS Versicherung","talk":[{"tid":280,"title":"Lambda Core – HardCore","type":"talk","short":["For about two years now – so called lambda expressions can be used by Java developers. But what does it mean... Lambda? The talk will be about story behind, from a little bit more scientific point of view. Church Lambda calculus, Entscheidungsproblem and incompleteness theorem."],"long":["For about two years now – so called lambda expressions can be used by Java developers. But what does it mean... Lambda? The talk will be about story behind, from a little bit more scientific point of view. Church Lambda calculus, Entscheidungsproblem and incompleteness theorem. ","However, almost all of that will be presented in Java. There are going to be shown some very crazy code pieces such as magic Y combinator and perfectly unusable implementation of Boolean (based on Lambda expressions)."]}],"tags":["java"]},{"firstname":"Karina","lastname":"Popova","pageurl":"karina-popova","url":"http://karinapopova.com/","photo":"Karina Popova.jpg","company":"whatever mobile GmbH","talk":[{"tid":285,"title":"Increasing Sensing Quality of Life with a SIM based connectivity solution for IoT","type":"talk","short":["The proposal idea is the 'wherever SIM' that provides the network coverage wherever devices may roam – integrating 400+ radio networks in 160+ countries all around the world. SIM cards and endpoints can be easily managed in real-time via the intuitive user-interface or directly from the customer’s software application via an easy-to-integrate API."],"long":["The insights to be gained from data are endless. In light of this a, new paradigm of the real-time communication between things has emerged, in which the quality of life of citizens in dense urban environments is increased through the use big data and cloud technology.","Future cities are likely to feature thousands of strategically placed sensors that would record everything from air pressure and temperature to microbial content, and the data would be relayed instantly to the laptops of actively participating smart citizens, who will make critical contributions to urban planning, reducing pollution, and making the best use of finite resources.","The rapidly changing social and environmental order is becoming more complex as resources grow scarcer and populations increase, it requires just one technical integration point in IoT, which will provide technological fluency in the use big data for public benefit.","The IoT market is growing rapidly. Mobile connectivity is becoming more and more a key success factor for many IoT projects, as most use cases are designed for mobility. But even for scenarios with immobile endpoints it often makes sense to include mobile connectivity as a fallback option, especially for time critical services.","The key features, implementation and development process of whereverSIM will be discussed."]}],"tags":["iot"]},{"firstname":"Maciek","lastname":"Próchniak","pageurl":"maciek-prochniak","url":"https://twitter.com/mpproch","photo":"Maciek Prochniak.png","company":"TouK","talk":[{"tid":290,"title":"Streams, flows and storms – how not to drown with your data?","type":"talk","short":["The landscape of stream processing frameworks gets more and more complicated. Some time ago Apache Storm was the only boy/girl in town. After that Spark Streaming emerged, then Apache Flink – European answer to Storm & Spark. What’s more – lately Apache Beam entered incubation stage – aiming at API unification and backed by Google.","There's also Kafka Streams that appeared just few days ago. In the talk I’d like to clear things a bit to help listeners (and myself) decide – which of above fit particular needs and which ones are stable enough to be used without fear. We'll focus not on particular frameworks, but what problems arise in stream applications and how to deal with them."],"long":["The landscape of stream processing frameworks gets more and more complicated. Some time ago Apache Storm was the only boy/girl in town. After that Spark Streaming emerged, then Apache Flink – European answer to Storm & Spark. What’s more – lately Apache Beam entered incubation stage – aiming at API unification and backed by Google.","There's also Kafka Streams that appeared just few days ago. In the talk I’d like to clear things a bit to help listeners (and myself) decide – which of above fit particular needs and which ones are stable enough to be used without fear. We'll focus not on particular frameworks, but what problems arise in stream applications and how to deal with them. This includes subjects such as raw throughput, latency, window semantics, handling out of order events, storing state, processing guarantees and so on.","As for solutions, the talk focuses on Apache Flink & Kafka Streams. Each will be discussed briefly together with short demo. The talk ends with few general tips on how to choose technology for different types of projects."]}],"tags":["bigdata"]},{"firstname":"Marcin","lastname":"Szymaniuk","pageurl":"marcin-szymaniuk","url":"","photo":"Marcin Szymaniuk.jpg","company":"ProData Consult","talk":[{"tid":295,"title":"Apache Spark? If it only worked.","type":"talk","short":["Spark has very nice API and it promises high performance of crunching large datasets. It’s really easy to write an app in Spark, unfortunately it’s also easy to write one which doesn’t perform the way you would expect or just fails for no obvious reason. The talk will introduce a practical framework for fixing most common problems with Spark applications."],"long":["Do you have plans to start working with Apache Spark? Are you already working with Spark but you are not happy, you don’t get expected performance and stability and you not sure where to look for a fix? Spark has very nice API and it promises high performance of crunching large datasets. It’s really easy to write an app in Spark, unfortunately it’s also easy to write one which doesn’t perform the way you would expect or just fails for no obvious reason. This talk will consist of multiple common problems one might face when running spark at scale and solutions for them of course. Each of described problems will come with well described background and examples so it will be understood by people with no Spark experience, although people who are working with spark are the main audience. At the end the audience should get a practical framework for optimizing Spark and fixing most common problems with Spark applications. Class of problems in the presentation: Dealing with skewed data Spark on yarn and it’s memory model Caching Sizing executors Locality "]}],"tags":["bigdata"]},{"firstname":"Matija","lastname":"Gobec","pageurl":"matija-gobec","url":"http://www.linkedin.com/in/matijagobec","photo":"Matija Gobec.png","company":"SmartCat.io","talk":[{"tid":300,"title":"Real-time analytics with fast data stack","type":"talk","short":["Data analytics was considered to be a time and resource consuming job and it was executed offline and usually on previously acquired data. Then came the lambda architecture that brought a lot of new concepts on how data is stored and analyzed in near-real-time. Todays standards require us to analyze data in real-time so that we can react accordingly and gain insights as the data is streamed into our system."],"long":["Traditional data warehousing and data analytics was an offline job and it usually required a lot of time to complete and give some results. These operations gave us some insight into our business but we had a limited possibility to improve or react in a timely manner. One of the efforts to move this approach closer to real-time was described with Lambda architecture where raw data was stored in real-time while also being analyzed in parallel and producing results with a certain delay. This approach eliminated those long running jobs by preparing analytic results on the incoming data but in todays business right information at the right time can mean improving our business and directly leading to more profit. Our latest technologies give us possibility to execute analytics on data streams and react almost instantly. Faster data requires faster reactions especially if its a fraud detection or a mission critical system. NoETL philosophy explains why the traditional approach is no longer valid and why we need these new technologies that we have today. In this presentation we are going to talk about the evolution from monolithic to distributed systems, pros and cons of both approaches and what we are able to do with todays technologies. Our main focus is going to be fast data stack (Spark, Mesos, Akka, Cassandra, Kafka) and how using these technologies we can create scalable and fast data pipeline while running real-time data analytics."]}],"tags":["bigdata","data analytics"]},{"firstname":"Michał","lastname":"Płachta","pageurl":"michal-plachta","url":"https://twitter.com/miciek","photo":"Michal Plachta.jpg","company":"Ocado Technology  ","talk":[{"tid":305,"title":"Building multiplayer game using streams","type":"talk","short":["In this talk you will learn how stream-based programming can be used to implement web frontend and multiplayer backend of the classic game. I will show you how to implement both frontend and multiplayer backend components in different languages and libraries but using very similar concepts and API."],"long":["In this talk you will learn how stream-based programming can be used to implement web frontend and multiplayer backend of the classic game: Snake. Building dynamic applications using imperative approach tends to create lots of unmaintainable code. Stream-based programming tries to solve this problem by introducing fully declarative way of defining application logic. While using streams, you will focus on WHAT needs to be done, not HOW and WHEN. The talk is divided into 3 parts. In the first part you will learn how to create a frontend of the Snake web game using streams as building blocks. Then, we will move to the server side and use Scala and Akka Stream library to create backend service that will allow the game to be played by multiple players. In the third part, we will discuss reactive streams and how they make asynchronous communication safe. "]}],"tags":["web","game"]},{"firstname":"Luca","lastname":"Mezzalira","pageurl":"luca-mezzalira","url":"http://lucamezzalira.com","photo":"Luca Mezzalira.jpg","company":"Massive Interactive, Inc","talk":[{"tid":310,"title":"Next generation of frontend architectures","type":"talk","short":["Will Reactive programming be the default choice for modern apps? When would you want to use event emitters as opposed to event streams with operators? In this session you'll find the answers to those questions and much more! If you want to learn more about Reactive Programming that's exactly the session for you! "],"long":["If you're puzzled by the newest generation of frontend architectures, you're not alone. Will Reactive programming be the default choice for modern apps? When would you want to use event emitters as opposed to event streams with operators? Luca Mezzalira answers these questions and more as he provides a detailed tour of frontend architectures, including where they've been and where we're headed. Luca will begin with an overview of architectures from MVC, MVP, and MVVM to the modern component systems like Flux and React. You'll take a look at the evolution of architectures, beginning with a central event emitter or publish/subscribe system that's currently used in JavaScript libraries and frameworks. You'll contrast these with Reactive programming and channels communication that's offered by CSP (Communicating Sequential Processes). By the end of this session, you'll understand if and when to use each particular paradigm. Specific topics include: A review of current event-driven architectures CSP and Transducers An introduction to Reactive programming How to use streams MVI and other reactive architectures"]}],"tags":["web","javascript"]},{"firstname":"Mihailo","lastname":"Milenković","pageurl":"mihailo-milenkovic","url":"https://rs.linkedin.com/in/mihailomilenkovic","photo":"Mihailo Milenkovic.jpg","company":"Deploy Inc.","talk":[{"tid":315,"title":"Developing custom Android device","type":"talk","short":["In the era of IoT, the need to create a custom device for specific purpose is growing day by day. While working on Ray universal remote we faced a lot of challenges to adapt the firmware to specific needs. This presentation will be an overview of what it takes to create your own custom Android based device and what are the greatest challenges."],"long":["During the presentation we`ll go through all aspects of what needs to be done to run Android on a custom hardware. The example used in the presentation will be Ray universal remote (www.ray.co) and NXP/Freescale iMX6 platform (http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/i.mx-applications-processors/i.mx-6-processors/i.mx6qp/sabre-platform-for-smart-devices-reference-design-based-on-the-i.mx-6-series:RDIMX6SABREPLAT). We`ll go through adaptation of bootloader (U-Boot), writing drivers in kernel and defining the device tree for custom hardware, and in the end modification of Android framework and expanding SDK for custom peripherials. "]}],"tags":["android","mobile"]},{"firstname":"Pance","lastname":"Cavkovski","pageurl":"pance-cavkovski","url":"http://pance.mk/","photo":"Pance Cavkovski.jpg","company":"Netcetera","talk":[{"tid":320,"title":"DIY Java & Kubernetes","type":"talk","short":["Introduction and a live demo covering the basics of containerizing Java applications or microservices with Spring Boot, deploying and running them on a gcloud kubernetes container engine and a home made Kubernetes cluster made out of RaspberryPis. "],"long":["Kubernetes is an open-source project, primarily developed by Google, which provides a solution for orchestrating, or scheduling, containers in a cluster. It defines several paradigms on top of just the container distribution, like pods, services, labels and controllers which makes the deployment and the operation of your applications much more simpler. This talk will cover the basic concepts behind Kubernetes, and a live demo will show how to operate your cluster and deploy your apps on it."]}],"tags":["microservices"]},{"firstname":"Ralph","lastname":"Winzinger","pageurl":"ralph-winziger","url":"https://twitter.com/@rwinz","photo":"Ralph Winzinger.jpg","company":"Senacor Technologies","talk":[{"tid":325,"title":"Event Sourcing in Microservices","type":"talk","short":["Why do we build applications based on microservices? To gain flexibility and resilience - that’s what everybody tells us. But building and application with a lot of microservices leads to a highly distributed system - and distribution hurts! As soon as you start interacting with a remote process you will have to bear in mind that messages might get lost, the network might go down and you will experience that communication will surely increase the latency your users are about to experience while using your system."],"long":["Why do we build applications based on microservices? To gain flexibility and resilience - that’s what everybody tells us. But building and application with a lot of microservices leads to a highly distributed system - and distribution hurts! As soon as you start interacting with a remote process you will have to bear in mind that messages might get lost, the network might go down and you will experience that communication will surely increase the latency your users are about to experience while using your system. So how can we break a large application into small microservices while keeping dependencies between those services at the lowest possible level and how can we reduce communication in the overall system? We will have a look at „Event-Sourcing“ as a possible and very cool answer for these questions. The basic idea is that every component emits relevant (from a business point of view) state changes as events. Those events are used a technique for asynchronous communication and data exchange/replication between microservices. The talk will also include some code samples to demonstrate how to introduce event sourcing in Java-based microservices."]}],"tags":["microservices"]},{"firstname":"Stjepan","lastname":"Hadjić","pageurl":"stjepan-hadjic","url":"https://twitter.com/_Beast_","photo":"Stjepan Hadjic.jpg","company":"Infinum","talk":[{"tid":330,"title":"Blazingfast™ deployment with mina","type":"talk","short":["Developers deploy their applications several times a day. Therefore deployment needs to be fast, secure and, most important, easy. Many ruby developers use capistrano, and many more (PHP) are writing their own FTP scripts. With easy to write DSL, error resistant scripts and blazingfast execution time (even for rails application) Mina is making deployment fun again!"],"long":["TBA"]}],"tags":["web","ruby"]},{"firstname":"Zoltán","lastname":"Németh","pageurl":"zoltan-nemeth","url":"","photo":"Zoltan Nemeth.jpg","company":"Ustream, Inc","talk":[{"tid":335,"title":"Scalable Service Architectures","type":"talk","short":["Service oriented architectures are getting more and more widespread popularity, because of the benefits they offer. They have some design requirements though, a very important one of them is designing services (and their combinations) for scalability and resilience. We did a couple of these in the past years and learned a lot about how to do it and what open source tools are available to achieve the goal.","In this talk I will describe the most important requirements of scalability, then our experience with them."],"long":["TBA"]}],"tags":["docker"]},{"firstname":"Gustavo","lastname":"Elias","pageurl":"gustavo-elias","url":"https://twitter.com/@archtavo","photo":"Gustavo Elias.jpg","company":"IG","talk":[{"tid":340,"title":"How to deal with a hot potato","type":"talk","short":["In large organisations, sometimes projects and parts of the code base get shuffled around between teams. Projects that have tons of responsibilities, that are business critical and that are hard to look after. What happens when a self-organised team that has a continuous delivery system in place receives one of these legacy product that is the antithesis of best practices? The talk approaches this issue with a real life example, highlighting the problems encountered and the solutions suggested and applied to each of them."],"long":["The talk starts describing what a hot potato is: a project that breaks all the good practices a team has in place but it’s business critical and needs to be handled. After a general introduction, it gets down into more specific details of the project that need to be addressed: two months deployment cycle, extremely long start-up time, huge amount of responsibilities... And then breaks them down into smaller, more approachable problems. Once the problems have been reduced to something that can be handled, the talk approaches possible solutions.","It explains pros and cons of each of them an why one is chosen over the other: the two-months deployment cycle gets dramatically reduced by creating a bamboo plan owned by the team; the start-up time decrements in several steps that include blue-green deployment plus code refactoring; and many other issues get resolved piece by piece. Why are these solutions chosen over others? Sometimes for its quality, sometimes it's chosen due to certain constrains like time, resources, adaptability... Reasons for each of them are the centre of the talk. Finalising the talk, there is a comparison between how the project looked at the beginning and how it behaves after all the improvements."]}],"tags":["devops"]},{"firstname":"Akos","lastname":"Tolnai","pageurl":"akos-tolnai","url":"http://abilitymatrix.com/","photo":"Akos Tolnai.png","company":"AbilityMatrix, Inc.","talk":[{"tid":345,"title":"5 HW Startups - Lessons learned while mentoring","type":"talk","short":["1 successful crowdfunding campaign, a successful Web Summit presence resulting in second round of funding and putting other HW startups back on track highlighted a lot of different traps that founders can avoid. The talk is about dos and donts and different strategies for the challenges each HW startup is going to face."],"long":["Tech founders tend to focus on the technical challenge and rarely test their ideas in the early prototype phase. Often business benefits and social presence become secondary to innovation. But in the end you need customers, and happy customers. What are the steps you can make while developing to generate customers, evangelists and how to gather feedback without the final product? How to keep the sales going without any product? Why not wait until the final prototype? What have learned with early testing? Why and how should you define the business value? Why lean startup methods won’t work if you are running a HW startup? How business decisions like patenting or open sourcing can make or break your build up and content marketing? When should you put your prototype in the hands of your first users? How can you learn? What do founders miss while testing? A lots of dos and donts for HW and IoT startup founders."]}],"tags":["iot","startups"]},{"firstname":"Matija","lastname":"Čupić","pageurl":"matija-cupic","url":"https://www.linkedin.com/in/mattrex","photo":"Matija Cupic.jpg","company":"Regional Center for Talented Youth II","talk":[{"tid":350,"title":"PageGaze - Interactive Webpage Eye-Tracking Technology","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":["web","javascript","ux/ui"]},{"firstname":"Jovica","lastname":"Kesić","pageurl":"jovica-kesic","url":"https://twitter.com/joxwell","photo":"Jovica Kesic.jpg","company":"Telegroup","talk":[{"tid":355,"title":"Bringing Social Networks to living room using JS APIs","type":"talk","short":["In the era of social networks and multimedia, TV that is sitting in our living room is becoming more and more like entertainment center, not just a device that we use to watch news, some sports event or our favorite series. Nowadays, people want to sit back in their couch, relax, and be able to do things that can be done on computers and smartphones, just on a large screen. From watching YouTube videos, sharing and posting on Facebook, or following latest trends on twitter, creators of Smart TV applications are struggling to make this possible and accessible by using only few remote controller buttons. Different solutions that enable user to interact with most popular internet services today, from Android and Apple TV, to standard Smart TVs are not available to everyone. Our wish was to bring this technology to every home that has domestic IPTV service. So, we rolled up our sleeves, took a leap into JavaScript world of different API’s, optimizations for TV box embedded operating systems, limitations of hardware, and interface specifics, and delivered a product that can match today’s most modern solutions in TV applications. This is our success story, one that tells how we took 80$ TV box, and put Facebook, twitter and YouTube inside it."],"long":["This talk will cover all aspects of delivering social networks experiences to lightweight TV box sets, but it will be concentrated around usage of JavaScript API that Facebook, twitter and Google provide for developing third party applications. In introduction we will be talking about apps development for TV boxes in general: specifics of TV interface, limitations of hardware, summary of TV box operating systems and web browsers and technologies that can be used. In implementation we will do short summary of all APIs needed for development, concentrating on explanation of key parts of code like login and authorization, data fetching, presentation of content, and posting users actions and feedback. We will also give parallel comparison of Google, Facebook and twitter API’s, and a small live coding demo of most interesting functionalities like sharing information about currently watched TV channel on Facebook and twitter, or playback of YouTube videos. In challenges and limitations, we will talk of things that are hard to be done, or cannot be done, such as long process of Facebook authorization, workarounds that enable simple and user friendly login to twitter, or videos that are allowed to be played only on YouTube web site. Also, we will say something more about functionalities that these companies do not enable to third party apps such as viewing your friends profile on Facebook, or adding previously watched video to YouTube history. At the end, in experience, we will give you a live demo of how it works, using real Set Top Box device. We will turn it on, and see some of its great features like: + Device login – enables us to avoid entering username and password using remote controller + YouTube auto play – user can search for its favorite video once, and enjoy similar videos playing one by one, for hours + Twitter and Facebook one-button share – when you watch your favorite TV show, and want your friends to know about it, you just need to enter Facebook or twitter app, and press a button to share it + Adaptive video quality – depending of quality of your internet connection, YouTube automatically chooses best possible video quality up to HD, without you ever needing to set it manually "]}],"tags":["javascript"]},{"firstname":"Zeljko","lastname":"Turbić","pageurl":"zeljko-turbic","url":"https://rs.linkedin.com/in/zturbic","photo":"Zeljko Turbic.png","company":"Levi 9","talk":[{"tid":360,"title":"Smart lighting: part of the ‘Internet of Things’","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":["iot"]},{"firstname":"Wouter","lastname":"Postma","pageurl":"wouter-postma","url":"https://nl.linkedin.com/in/wouterpostma","photo":"Wouter Postma.jpg","company":"Talpa Global","talk":[{"tid":365,"title":"Smart lighting: part of the ‘Internet of Things’","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":["iot"]},{"firstname":"Krzysztof","lastname":"Otrebski","pageurl":"krzysztof-otrebski","url":"https://twitter.com/kotrebski","photo":"Krzysztof Otrebski.jpg","company":"Ocado Technology","talk":[{"tid":370,"title":"Beat Aliens with Akka Cluster","type":"talk","short":["Computer game run with 3 x Raspberry Pi, 1 x Router, 1x Laptop, => trying to kill game by disconnecting network cables or power source, testing if application is self healing"],"long":["Does anyone remember the game 'Missile Command' on Atari? I bet you know it or played some kind of clone. I have also crated clone but with small difference, computer system is defending cities. During this session I would like to run missile defence system on a few Raspberry Pi's. Under the hood there will be Scala and Akka Cluster. You want to have defence system which is responsive and resilient, so do I. I will perform network and power failures to provide some idea how quickly it can recover, heal itself and prove that Akka application can be responsive and resilient."]}],"tags":["scala"]},{"firstname":"Rafael","lastname":"Ordog","pageurl":"rafael-ordog","url":"https://twitter.com/LeanPoker","photo":"Rafael Ordog.jpg","company":"Emarsys","talk":[{"tid":375,"title":"Lean Poker","type":"workshop","short":["Lean Poker is a day long coding challenge that's not only fun, but also provides a safe environment in which you can practice continuous deployment and fast delivery of valuable software."],"long":["Lean Poker is a day long coding challenge that's not only fun, but also provides a safe environment in which you can practice continuous deployment and fast delivery of valuable software.","You and a small group of strangers are going to develop a bot in a language of your choice, that plays poker against other bots. All you need to do is write a function that takes a data structure containing cards and bets your bot sees during the game, and return a single number: the amount you are willing to bet at that point.","Now here is the catch: even before you start coding the bots play a round in a matter of seconds, and if your bot wins you get points. If it comes second, you get less points. Otherwise you get nothing. The next minute another game plays, and another one, and another one… that goes on all day long, while you and your friends are desperately hacking away on the code, and keep deploying version after version. ","During this pretty intense day you will sometimes be cheering for your bot to take over, you will be deploying desperately to change the course of events when your bot keeps losing, but even more importantly you will learn how to create as much value as you can in a short period of time, while you are mostly just having fun."]}],"tags":["devops","metodologies"]},{"firstname":"Maja","lastname":"Božić","pageurl":"maja-bozic","url":"https://www.vegaitsourcing.rs/#!/about-us/people/maja-bozic","photo":"Maja Bozic.jpg","company":"Vega IT Sourcing","talk":[{"tid":380,"title":"Happiness at Work in IT World","secondspeaker":"Maja Nedučić","type":"workshop","short":["Happiness at work is one of the 3 most important sources of happiness in life.","You will spend 1/3 of your life at work. If you are unhappy at work, life becomes hell.","By participating in a workshop on happiness at work any group of people can become aware of its possibilities."],"long":["Happiness at work is one of the 3 most important sources of happiness in life.","You will spend 1/3 of your life at work. If you are unhappy at work, life becomes hell.","By participating in a workshop on happiness at work any group of people can become aware of its possibilities within one hour.","----","The focus of the workshop is to create more awareness on the subject:","• What makes me happy at work? - and no, it's not raises, bonuses and perks.","• What can I do to implement this directly in my work?","----","Results of the workshop","• You become more aware of your own thoughts and emotions and the possibility to influence them. ","• You experience the power of happiness at work.","• Through this experience you become more creative, productive and self-secure. You feel more resilient and better able to cope with change and stress.","----","Happiness at work makes you more effective: it has a positive influence on you, your team and your organization.","The workshop is interactive and asks for active participation of everyone involved."],"day":1,"track":0,"slot":"09:00","duration":60}],"tags":["business"]},{"firstname":"Maja","lastname":"Nedučić","pageurl":"maja-neducic","url":"https://www.vegaitsourcing.rs/#!/about-us/people/maja-nedu%C4%8Di%C4%87","photo":"Maja Neducic.jpg","company":"Vega IT Sourcing","talk":[{"tid":385,"title":"Happiness at Work in IT World","secondspeaker":"Maja Božić","type":"workshop","short":["Happiness at work is one of the 3 most important sources of happiness in life.","You will spend 1/3 of your life at work. If you are unhappy at work, life becomes hell.","By participating in a workshop on happiness at work any group of people can become aware of its possibilities."],"long":["Happiness at work is one of the 3 most important sources of happiness in life.","You will spend 1/3 of your life at work. If you are unhappy at work, life becomes hell.","By participating in a workshop on happiness at work any group of people can become aware of its possibilities within one hour.","----","The focus of the workshop is to create more awareness on the subject:","• What makes me happy at work? - and no, it's not raises, bonuses and perks.","• What can I do to implement this directly in my work?","----","Results of the workshop","• You become more aware of your own thoughts and emotions and the possibility to influence them. ","• You experience the power of happiness at work.","• Through this experience you become more creative, productive and self-secure. You feel more resilient and better able to cope with change and stress.","----","Happiness at work makes you more effective: it has a positive influence on you, your team and your organization.","The workshop is interactive and asks for active participation of everyone involved."]}],"tags":["business"]},{"firstname":"Catherine","lastname":"Simon","pageurl":"catherine-simon","url":"https://www.namics.com/person/catherine-ferrary-simon/","photo":"Catherine Simon.jpg","company":"Namics","talk":[{"tid":390,"title":"What`s your motivation?","type":"talk","short":["We go through the motions, we do our jobs, another day - another dollar. But are we progressing, what is your motivation? Research suggests that when we are intrinsically motivated by our work we are more likely to get promoted, are you on the path for personal growth, or just spinning your wheels?"],"long":["In this interactive workshop style talk, we'll delve into your personal strengths and passions and how they apply to your work. Your motivation and dedication in your work can dictate your future success, whether that be as a integral part of a larger company or as an entrepreneur. By applying some basic principles of project management, we'll make you the focus and create a blueprint of how your career and life can be.","Exercises include:","1) Your zones of genius","2) Your personal blueprint","3) The importance of being a mentor & mentee"]}],"tags":null},{"firstname":"Daniel","lastname":"Gartmann","pageurl":"daniel-gartman","url":"https://uk.linkedin.com/in/danielgartmann","photo":"Daniel Gartmann.jpg","company":"Zuhlke Engineering","talk":[{"tid":395,"title":"Harness the power of HTTP headers to secure your web apps","type":"talk","short":["Nowadays almost everyone uses web browsers on a daily basis for various tasks such as reading emails, surfing on social networks or purchasing goods on ecommerce shops. Despite this, web developers often tend to forget that a browser is a piece of software that has deliberately been designed as a remote code execution engine, which is the dream spec for any attacker. The focus of this talk is to explain how some of the newly introduced headers (HSTS, HPKP, CSP) can help to easily add an extra layer of security in order to defend your web apps against common web security vulnerabilities."],"long":["Security flaws on websites are very widespread and depending on the nature of the website can lead to severe consequences. One of the reason why securing web apps can be challenging is that many security aspects such as client side security, transport security and server side security have to be considered during design, implementation and operation. Another fundamental problem of the web is the web browser that has deliberately been designed as remote code execution engine which is the dream platform for any attacker wanting, for instance, to inject malicious code either by exploiting an Cross-Site Scripting (XSS) vulnerability or by mounting a man-in-the-middle attack. Since a browser executes JavaScript and HTML on the fly with 'almost' no security checks it is important to be able to identify the origin of the content and to take advantage of the available means to restrict how the browser executes the web app. This is exactly what this talk is about! I will start with brief overview about what is wrong with the web and especially with web browsers. Then I will explain why secure transport is so important and point out the different guarantees that HTTPS provides, such as confidentiality, authenticity and integrity and why there is no valid reason for not using it over HTTP. I will show you how to get a free certificate for your website and how to test the HTTPS configuration. The main focus of this talk are the newly introduced headers, such as HTTP Strict Transport Security (HSTS), HTTP Public Key Pinning (HPKP) and Content Security Policy (CSP). I will explain how HSTS and HPKP help to harden HTTPS against various attacks but also present the best practices for avoiding the common pitfalls. I will continue by explaining CSP and its capabilities, such as preventing Cross-Site Scripting (XSS) or Clickjacking attacks. I will also give best practices about deriving the CSP policies without having negative side effects on your website and present tools that will make your CSP journey as easy as pie. All the aforementioned headers offer security “for free” in the defence of your web apps so start using them today!"]}],"tags":["web","security"]},{"firstname":"Kenan","lastname":"Sevindik","pageurl":"kenan-sevindik","url":"https://twitter.com/KenanSevindik","photo":"Kenan Sevindik.png","company":"Harezmi IT Solutions","talk":[{"tid":400,"title":"Employing a View Model API Based on Dynamic Proxies","type":"talk","short":["Enterprise apps are mainly built upon layered architecture. Each layer only speaks to its below layer, and data among layers are shared via persistent domain objects. However, employing same domain objects in each layer causes some problems. Data might be modified unintentionally in which an ORM tool or a UI framework like JSF is used. Binding domain objects with UI fields directly creates a mess inside domain classes because of UI only fields added. To prevent such problems, it's better to employ a separate model, specific to the UI layer. Such a separate model is employed to convert data obtained from back, and deliver it to the UI layer for presentation. UI components are bound to view model objects so that user input is first accumulated into those objects and delivered to back when appropriate. However, creating such a view model mainly overlaps with persistent domain model, and job of handling data transformations between two model is a tedious task. We propose a solution based on dynamic proxies to create view model classes automatically and an API to handle various tasks occur during those data transformations. We will present our solution and discuss about the API evolved over time."],"long":["In todays world, layered architecture is a very common approach among enterprise applications. Each layer has a specific task of its own, and each one is only allowed to speak just one below. For example, data access layer deals with querying and persistence of data, service layer coordinates business operations and interacts with data access layer, presentation layer handles rendering of suitable user interface as well as processing user requests while talking with service layer. In this picture, data transfer throughout the layers is achieved using domain objects. For example, data is fetched from target datastore, then transformed into domain objects in data access layer, and delivered to the presentation layer for rendering purposes. In a similar way, domain objects bound to UI are filled with user input, then passed into backend layers for processing.","However, employing same domain classes in every layer can cause some data related problems in those applications. One might see that data might get inserted, updated or deleted unintentionally, especially when an ORM tool, like Hibernate is used for persisting data, UI frameworks like JSF or Vaadin, in which state management is handled on server side, while domain objects are directly bound to user interface components, used to collect user input and deliver it to the backend. Moreover, employing domain objects UI interaction might cause several fields and methods which are only needed by presentation layer get added into them. For example, adding a selected field and its corresponding getter/setter is a very common issue in order to identify which rows are selected in a UI table. That 'selected' property has nothing to the with the domain model at all.","In order to prevent such data integrity problems, and keep domain classes clean from UI specific attributes and methods, one needs to create and use a separate model targeted to the presentation layer. It may appear with different names, like 'data transfer object', 'data value object' or 'view model' in different projects, and whatever you call it for, its main duty is to prevent direct interaction and manipulation of domain objects via user interface components.","Although, we take it as a separate model, view model classes mostly overlap with domain model classes. Indeed, domain model classes can easily be transformed into view model classes with some additions of fields and methods. Actually, it becomes a burden for developers to just create and use a second set of model classes which are almost identical to domain model. We propose a solution to automatically derive those view model classes from domain model classes using proxy pattern, and define an API to handle various data related tasks which occur while transforming domain objects into view model objects, apply those user changes occurred in those view model objects during UI interaction back again to domain instances etc. With the help of such an automatic view model creation mechanism, task of creating view model classes manually becomes unnecessary. In addition, view model – domain model back and forth transformations and data related operations can be performed easily through a standard API. In this session, I am going to talk about how to employ dynamic proxy class generation to obtain view model out of domain model classes, and discuss view model API in detail."]}],"tags":["java","ux/ui"]},{"firstname":"Aleksandar","lastname":"Vacić","pageurl":"aleksandar-vacic","url":"https://mobile.twitter.com/radiantav?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor","photo":"Aleksandar Vacic.jpg","company":"Radiant Tap","talk":[{"tid":405,"title":"Fresh Cup of iOS 10","type":"talk","short":["iOS 10 lands right around the conference time. Learn what to focus on."],"long":["Each year, Apple puts emphasis on just a handful of - as they call them - tentpole features in annual iOS major release. Those feature are the one they look for, when deciding which apps to feature and promote on the App Store. Learn what are your best bets in the iOS 10 cycle, especially when approaching Christmass quarter."]}],"tags":["mobile","ios"]},{"firstname":"Martin","lastname":"Toshev","pageurl":"martin-toshev","url":"https://twitter.com/martin_fmi","photo":"Martin Toshev.jpg","company":"","talk":[{"tid":410,"title":"JVM++: The Graal VM","type":"talk","short":["In this session we will provide an overview on how is the Graal VM evolving from an Oracle research project to a potential candidate for subsequent JVM releases. During the talk we will provide details on how does the Graal VM aim to improve the runtime compilation of the JVM in order to bring the performance of Java to interpreted languages."],"long":["In this session we will provide an overview on how is the Graal VM evolving from an Oracle research project to a potential candidate for subsequent JVM releases. During the talk we will provide details on how does the Graal VM aim to improve the runtime compilation of the JVM in order to bring the performance of Java to interpreted languages. The first part of the talk discussed in general what is the Graal VM in general. The second part of the talk discusses details around the Graal VM along with some benchmark on how does it improve the performance of the JVM in some particular cases and how does the Graal compiler cooperate with the Java compiler API targeted for Java 9  (proposed as JEP243)."]}],"tags":["java","performance"]},{"firstname":"Nikola","lastname":"Sijakinjić","pageurl":"nikola-sijakinjic","url":"https://www.linkedin.com/in/nikola-sijakinjic-61346b20?trk=hp-identity-name","photo":"Nikola Sijakinjic.png","company":"Fincore Group","talk":[{"tid":415,"title":"Easy scaling with Hazlecast","type":"talk","short":["Hazelcast is popular data-grid implemented in Java. Presentation will cover road from monolith application to distributed system of microservices using Hazelcast as memory store, similar to https://www.youtube.com/watch?v=3bBtMrjD0zo"],"long":["In-Memory data grids have historically been the exclusive domain of large investment banks and proprietary solutions such as Oracle Coherence, Pivotal Gemfire and Software AG Terracotta. Hazelcast provides a opensource solution that is easy to develop, elastic in scaling and fault tolerant. Implemented in Java it offers some key advantages compared to other opensource players in arena. You can't send logic execution to Memcached node and Redis LUA interpreter is no match for state of art JVM. Also, it fits easily in Java micro-services architectures."]}],"tags":["java","microservices"]},{"firstname":"Damir","lastname":"Svrtan","pageurl":"damir-svrtan","url":"http://damir.svrtan.me/","photo":"Damir Svrtan.jpg","company":"Infinum","talk":[{"tid":420,"title":"Stop wasting time NOT writing tests","type":"talk","short":["I go mad when I hear: 'We have no time for tests'. Learn why that statement is so wrong and how to make tests a 'must have' in your workflow"],"long":["TBA"]}]},{"firstname":"Dejan","lastname":"Dimić","pageurl":"dejan-dimic","url":"https://twitter.com/dejan_dimic","photo":"Dejan Dimic.jpg","company":"Vibe Network","talk":[{"tid":425,"title":"Sex Lies and Design patterns","type":"talk","short":["Almost all in software industry agrees that design patterns are important and beneficial for success of any project. Some regard them as an essential part of ‘good practices”. In a perspective there is something sexy and awesome in reading some code and recognize applied design patterns.","In real situations, one of the things that fall in oblivion and somehow get lost from developers perspective, right after documentation and most probably side by side with tests, are design patterns. Both in design and architecture phase and implementation phase.","Nowadays, the software solutions are more and more complex. The need to mimic the real life is greater and greater. Ergo the need to use and apply the proven solution from real life and software industry described as 'design patterns' should be more in our focus and part of our solutions.","Knowledge to recognize the problem, the context and to pick appropriate design patterns will become essential for creating any worth mention solution.","In this presentation I would like to share some of the real life design patterns that can improve your software solution and drive your product to a golden state"],"long":["Almost all in software industry agrees that design patterns are important and beneficial for success of any project. Some regard them as an essential part of ‘good practices”. In a perspective there is something sexy and awesome in reading some code and recognize applied design patterns.","On the other hand, more in the land of reality, most development efforts are done under various pressures, from vague specifications, short schedules, ridiculous time to market constraints and similar. As a result what is called good practices usually suffer and get substitute with just practices, or less.","One of the things that fall in oblivion and somehow get lost from developers perspective, right after documentation and most probably side by side with tests, are design patterns. Both in design and architecture phase and implementation phase.","There are numerous excuses reported by various developers why the design patterns are only consequence of implementation instead of  deliberate action of software architecture design in their projects.","This is totally bizarre to not use the tool whose main purpose is to show success path in order to solve the encountered problem. It’s even more strange as we know that all of design patterns come out of experience and long process of real life validation.","Regardless are we talking about design patterns or anti-patterns, they represent essence of the knowledge needed in order to overcome some obstacles in software we develop or in plain real life situations, usually both.","Nowadays, the software solutions are more and more complex. The need to mimic the real life is greater and greater. Ergo the need to use and apply the proven solution from real life and software industry described as 'design patterns' should be more in our focus and part of our solutions.","Knowledge to recognize the problem, the context and to pick appropriate design patterns will become essential for creating any worth mention solution.","In this presentation I would like to share some of the real life design patterns that can improve your software solution and drive your product to a golden state."]}],"tags":["design patterns"]},{"firstname":"Jakša","lastname":"Vučković","pageurl":"jaksa-vuckovic","url":"","photo":"Jaksa Vuckovic.jpg","company":"Zuhlke Engineering","talk":[{"tid":430,"title":"Why are Actors Terrible?","type":"talk","short":["This is the first part of the introduction to actors. Here we will cover only the negative side of actors. This presentation is complemented by a workshop which teaches 'proper' actor development. We will be debunking some common myths about the actor model. This talk is intentionally polemical and presents only one side of the story."],"long":["As distributed systems are becoming the norm, more demand rises for tools and methods for reliably building such systems. However, there is no silver bullet and just adopting a tool, technology or model does not make it easy to build reliable distributed systems. The actor based model existed since the 70s, but its popularity rose just in the last decade thanks to Erlang and Akka. As the actor model is adopted by more developers so are the misconceptions related to it. These misconceptions arise from marketing material and a general lack of understanding of distributed systems theory.","In this presentation we will analyse and debunk some myths that are typically attributed to the actor model such as:","1. ease of development","2. lack of deadlocks","3. the readability of the code","4. the implicit fault tolerance","5. high parallelisation","This presentation does not present a fair view on the actor model and relies on a complementary workshop 'Why are actors great' to mitigate that. Attendees will better understand when and why to use the actor model and the associated costs and benefits. The 'how' part of using the actor model will be presented in the 'Why are Actors Great' workshop."]},{"tid":435,"title":"Why are Actors Great?","type":"workshop","short":["This is the second part of the introduction to actors. Here we do a hands on session to learn to take advantage of using actors to develop concurrent and distributed fault tolerant systems. We will teach how to use actors properly avoiding the major pitfalls that a lot of novices make on their first approach to the actor based model."],"long":["Concurrent and distributed development has always been notoriously difficult to test. Methods like ad-hoc correctness proofs, temporal logic and model checking have been used for decades, but have always had downsides which prevented them from going mainstream. In this workshop we build on the theory presented in 'why are actors terrible' and teach a more efficient and effective method for building testable actor based systems. The approach presented uses some properties of the actor model and builds on TDD, property based testing and model checking in order to allow effective testing of distributed systems.","The workshop will include some hands on development using java+akka (or scala+akka if preferred). Attendees will have to use their laptops or work in pairs. We will try to build and test a correct implementation of a simple distributed algorithm such as the two phase commit. Ideally it should be 4 hours but we can adapt. Attendees will learn how to take advantage of the benefits of the actor model."]}],"tags":["distributed systems","java","testing"]},{"firstname":"Lukasz","lastname":"Lenart","pageurl":"lukasz-lenart","url":"https://twitter.com/lukaszlenart","photo":"Lukasz Lenart.jpg","company":"7N/Nykredit","talk":[{"tid":440,"title":"Lift framework in 45 minutes","type":"talk","short":["In 45 minutes I want to build a full blown web app based on Lift framework to show of its key features."],"long":["In 45 minutes I want to build a full blown web app based on Lift framework to show of its key features. It will be a live coding session for beginners."]}],"tags":["scala","web"]},{"firstname":"Aleksandar","lastname":"Simović","pageurl":"aleksandar-simovic","url":"https://twitter.com/simalexan","photo":"Aleksandar Simovic.jpg","company":"Right Fold","talk":[{"tid":445,"title":"Serverless chat bots with AWS Lambda","type":"talk","short":["How to build cheap (in most cases free) chat bots for Messenger, Slack, Telegram and more platforms in just a few minutes."],"long":["After a long time chat bots have been reborn with both Slack and Facebook Messenger. Why should you care and what can you do with a chat bot? Chat bots are capable of a lot of things, i.e. manage your daily standup meetings, do an onboarding for the new team members, get travel recommendations or even order a pizza!","Using AWS Lambda, the processes of chat bot deployment, maintenance, scaling and administration are almost non-existent and virtually free.","The goal of this talk is to explore how easy and cheap (actually free in most cases) it is to build a serverless chat bot for Messenger and Slack using Node.js and AWS Lambda - a quick immerse in the world of automatic chat bots.","And when already at it, why stop there? Besides these two, there are even more platforms you can build bots for, i.e. Telegram, Skype or even for some voice assistants, like Amazon Alexa."]}],"tags":["javascript"]},{"firstname":"Mirjana","lastname":"Kolarov","pageurl":"mirjana-kolarov","url":"https://rs.linkedin.com/in/mirjana-kolarov-62390a5","photo":"Mirjana Kolarov.png","company":"Levi 9","talk":[{"tid":450,"title":"What do testers actually do?","type":"talk","short":["Testers don't just click around. Real testers don't do Ad hoc testing at all. They carefully plan their activities and help the whole team to build better and usable products, by being a part of the project team from the beginning, before the first line of code is even written. Testers write code, read code, dig into databases and logs and communicate to customers. They are the link between the code and customers."],"long":["If you are wondering what do testers in my teams do, I'll try to explain it in the short presentation. We code - automated functional test, help developers define and decide which test should be included in the integration test. We also read code - doing white box testing, seeing did our colleagues missed something or added something extra. We also try to manage risk, point out risky parts of applications and ways to mitigate those. Testers care about performance by helping developers build the software in the way that it is optimized and fast, we don't just measure the response times. The same goes for security. Also, we are helping developers to get wider picture of the impact of their code on the whole system. In couple of word - we help a lot. Either by investigating the quality of the code delivered, or by clarifying the requirements, and sometimes creating specification, if the team is missing it. What you will learn from this presentation: 1. Why do you need testing? 2. What can a good tester do fro you and your team? 3. How proper testing can be organized 4. What to expect from your testers ( when you hire them) 5. What to look in a tester during hiring process."]}],"tags":["testing","security","metodologies"]},{"firstname":"Nikola","lastname":"Milutinović","pageurl":"nikola-milutinovic","url":"https://rs.linkedin.com/in/nikolamilutinovic","photo":"Nikola Milutinovic.jpg","company":"Levi 9","talk":[{"tid":455,"title":"Security in microservice architecture","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":["microservices","security"]},{"firstname":"Nikola","lastname":"Stojiljković","pageurl":"nikola-stojiljkovic","url":"https://twitter.com/nikstojiljkovic","photo":"Nikola Stojiljkovic.jpg","company":"Essential Dots d.o.o","talk":[{"tid":460,"title":"Data in the continuous delivery process","type":"talk","short":["Continuous delivery process is getting more and more attention, especially since the whole DevOps movement started. Package/build/dependency managers like npm, maven and composer make it easy for developers to package their code. Configuration management tools like Chef and Puppet make it easy to deploy the packages and configure the whole infrastructure. Vagrant allows developers to run on their machines (more or less) the exact copy of the production systems."],"long":["Continuous delivery process is getting more and more attention, especially since the whole DevOps movement started. Package/build/dependency managers like npm, maven and composer make it easy for developers to package their code. Configuration management tools like Chef and Puppet make it easy to deploy the packages and configure the whole infrastructure. Vagrant allows developers to run on their machines (more or less) the exact copy of the production systems. But why is there no popular tool for managing data in a continuous delivery process? Is it too complex or too specific? In this presentation, various flows of data in a continuous delivery process are presented, ranging from simple cases of small web sites run by content management systems, all the way to complex large-scale cloud-deployed operational databases used in e-commerce containing millions of private and encrypted records, while enforcing the PCI-DSS standard."]}],"tags":["db","cloud"]},{"firstname":"Perica","lastname":"Milošević","pageurl":"perica-milosevic","url":"https://www.linkedin.com/in/pericamilosevic","photo":"Perica Milosevic.jpg","company":"Sysdig","talk":[{"tid":465,"title":"The Dark Art of Container Monitoring","type":"talk","short":["This presentation covers the current state of the art for container monitoring (including real use-cases and pros/cons of each) and features live interaction with container environments and live demos of all the tools and techniques discussed. "],"long":["Containers are revolutionizing the way we deploy and maintain our infrastructures: reducing development overhead, streamlining dev / test / ops, and enabling highly scalable, dynamic infrastructures. But containers still have a key problem: monitoring and troubleshooting them is impractical, painful, and sometimes plain impossible. Even basic things like understanding what is using CPU, memory, or disk bandwidth inside a container are difficult - let alone finding out who a container is talking to on the network or tracking malicious activity. This presentation covers the current state of the art for container monitoring and visibility, including real use-cases and pros / cons of each.","The focus is on advanced container visibility techniques, such as:","* visualizing a container’s network activity","* understanding detailed resource usage (CPU, memory and disk I/O) of containers and individual processes running inside containers","* following process and user activity inside containers","* collecting logs from multiple containers","The presentation features live interaction with container environments and live demos of all the tools and techniques discussed. Special emphasis is put on sysdig, an open source container and system troubleshooting tool.","https://github.com/draios/sysdig"]}],"tags":["docker","monitoring"]},{"firstname":"Radek","lastname":"Ostrowski","pageurl":"radek-ostrowski","url":"https://uk.linkedin.com/in/radekostrowski","photo":"Radek Ostrowski.jpg","company":"Fast Data Ltd","talk":[{"tid":470,"title":"Finding Your Perfect Weather with Apache Spark and Docker","type":"talk","short":["This presentation tells a story of a hackathon project where mixing a cool idea with the latest technologies resulted in the grand prize and the fan favourite award of the IBM Sparkathon with nearly 600 participants. It will describe the key technologies used and how they were effectively combined in a short period of time. Psst... it will also share a secret recipe for a success in a hackathon... but don't tell anyone!"],"long":["This presentation tells a story of a hackathon project where mixing a cool idea with the latest technologies resulted in the grand prize and the fan favourite award of the IBM Sparkathon with nearly 600 participants. It will describe the key technologies used and how they were effectively combined in a short period of time. Psst... it will also share a secret recipe for a success in a hackathon... but don't tell anyone!","I would like to share my passion for Spark, Docker and Scala.","Here's the original project page: http://devpost.com/software/my-perfect-weather","And the actual service runs here (still in Beta): http://myperfectweather.eu"]}],"tags":["scala","docker"]},{"firstname":"Goran","lastname":"Aranđelović","pageurl":"goran-arandjelovic","url":"http://www.endava.com/","photo":"user.png","company":"Endava","talk":[{"tid":475,"title":"C++ for mobile developers","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":["mobile"]},{"firstname":"Miloš","lastname":"Milošević","pageurl":"milos-milosevic","url":"https://www.linkedin.com/in/milos-milosevic-33099850","photo":"Milos Milosevic.jpg","company":"Nordeus","talk":[{"tid":480,"title":"Pushkin - Open source messaging platform","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":null},{"firstname":"Vedran","lastname":"Vujinović","pageurl":"vedran-vujinovic","url":"https://www.linkedin.com/in/vedran-vujinovic-581428124","photo":"Vedran Vujinovic.jpg","company":"Comtrade","talk":[{"tid":485,"title":"Augmented reality: behind the scene","type":"talk","short":["Have you ever wondered what is the sorcery behind augmented reality? What it takes to transform 'ordinary' reality into something magical? Let’s take a peek behind the curtains and find out all the nuts and bolts it's made of and what makes it tick... well, on a fundamental level at least."],"long":["In the recent years we've seen a rising interest of the industry for virtual reality (VR) and lately for augmented reality (AR) as well. No wonder since it's the closest thing to holograms we've been dreaming of and drooling over in works of fiction for the past five decades or so. While VR brings 'total' immersion and a set of problems caused by it, AR promises future full of holograms all around us, our physical and virtual worlds finally collided and merged. It’s hard to even imagine, let alone predict all the ways it will affect content creation, user experience and overall interaction with the world around us. Advancements in processing power of mobile platforms and image sensors fueled this recent surge of interest towards AR, but there is still a long road ahead of us from having contact lens-like, inconspicuous AR devices capable of rendering augmentation indistinguishable from the reality.","This talk will focus more on some of the techniques used behind AR: computer vision algorithms, its usage in combination with computer graphics to achieve digital augmentation and evolution from simple marker-based and natural feature tracking to utilizing simultaneous localization and mapping (SLAM) algorithms. Basically, what it takes to come from matrix of bytes received from image sensor to superimposing another matrix of computer generated bytes that our eyes perceive as augmented reality."]}],"tags":["hw"]},{"firstname":"Ivan","lastname":"Nemytchenko","pageurl":"ivan-nemytchenko","url":"https://twitter.com/inem","photo":"Ivan Nemytchenko.jpg","company":"GitLab","talk":[{"tid":490,"title":"Breaking bad with GitLab CI","type":"talk","short":["It is common to use CI as a tool to run your tests and build you builds. But GitLab has more to offer.","I will show how GitLab uses its CI and how our clients use it. To give you a whole picture, I will demonstrate some crazy experiments. You would never think that something like this is possible to build with CI system"],"long":["It is common to use CI as a tool to run your tests and build you builds. But GitLab has more to offer.","I will show how GitLab uses its CI and how our clients use it. To give you a whole picture, I will demonstrate some crazy experiments. You would never think that something like this is possible to build with CI system","How do you like an idea to build a Docker container with a set of Ansible playbooks from another repo and run test inside generated container on the next step?","Other usages:","- Build a build farm","- Check spelling","- Generate documentation","- Run benchmarks","- Set up your deployment pipeline","- Use any static site generator","- and so on"]}]},{"firstname":"Antonis","lastname":"Kalipetis","pageurl":"antonis-kalipetis","url":"https://twitter.com/akalipetis","photo":"Antonis Kalipetis.jpg","company":"SourceLiar","talk":[{"tid":495,"title":"Docker 1.12: Orchestration, containers and beyond","type":"talk","short":["Docker has evolved from a container engine, to a complete end-to-end solution for orchestrating cloud-native applications. With the 1.12 release, you can use Docker to manage and orchestrate your infrastructure.","In this session, we'll explore Docker's evolution, we'll see the different components that make up Docker today and we'll have a nice demo of Docker's orchestration using Swarm mode."],"long":["Docker has gone a long way, from a container engine over LXC, to a complete solution including runC - a container runtime, containerd - a daemon to control containers, the Docker engine and the newly added Swarm mode - an orchestrator which can schedule everything from containers to VMs. Being a heavy user of Docker from version 0.6, I've gained a lot of experience using all the different tools around Docker and the Docker ecosystem, which I plan to share following Docker's journey.","Through this journey, we'll see the different tools that make up Docker and their responsibilities and how they contribute to the whole container ecosystem.","At the end of the session, I'll have a live demo of installing Docker, initializing a cluster and deploying services using Docker's swarm mode throughout the cluster."]},{"tid":500,"title":"Creating a cloud native development environment","type":"talk","short":["Continuous integration and delivery has evolved a lot during the last couple of years through containers and the different container schedulers and orchestrators. Our software delivery pipeline includes a lot of tools for securing and speeding up the process, while our development environments are still living in the past - packing everything in a single local VM.","During the session, we'll see the different pros and cons of having a cloud native developer environment, that lives in the cloud, is managed and replicates as close as possible the production infrastructure."],"long":["Having great experience in creating and managing thousands of developer environments in the cloud for our users at SourceLair - a cloud-based online IDE, which focuses primarily in automating user tasks and provisioning their infrastructure according to their needs - during the session I'll pinpoint the different challenges we have faced and all the interesting findings we have discovered through the process of creating an online IDE. Also, I'll describe the benefits of having a managed developer environment in the cloud and how this can benefit a company in terms of maintenance and time.","At the end of the session, I'll describe our vision for the future of developer environments, which sports a managed infrastructure that's easily accessed, defined and replicated across teams inside a company.","The session will contain a lot of examples that we've faced at SourceLair, but will not be centered around our product."]}],"tags":["docker"]},{"firstname":"Alexander","lastname":"Pacha","pageurl":"alexander-pacha","url":"http://my-it.at/","photo":"Alexander Pacha.jpg","company":"Zuhlke Engineering","talk":[{"tid":505,"title":"1, 2, 3, build - Continuous Integration for Mobile Apps","type":"talk","short":["Continuous Integration and Continuous Delivery are powerful processes to ensure quality and improve the release process. But when developing mobile Apps, you face many unique challenges, that I want to discuss in my talk. I am going to show tools that support you and give practical tips on how to continuously integrate your mobile App."],"long":["Continuous Integration and Continuous Delivery are powerful processes to ensure quality and improve the release process. But when developing mobile Apps, you face many unique challenges, that I want to discuss in my talk. I am going to show tools that support you and give practical tips on how to continuously integrate your mobile App.","I am going to show three platforms, ranging from one-click solutions to fully customizable build-platforms for building Android, iOS and Xamarin Apps and also how to perform advanced tasks like signing, automated testing and semi-automated deployment into App Stores."]}],"tags":["mobile"]},{"firstname":"Doan","lastname":"Duy Hai","pageurl":"doan-duy-hai","url":"http://twitter.com/@doanduyhai/","photo":"DuyHai Doan.jpg","company":"Datastax","talk":[{"tid":510,"title":"SASI, Cassandra on the full text search ride!","type":"talk","short":["Apache Cassandra is a scalable database with high availability features. But they come with severe limitations in term of querying capabilities. Since the introduction of SASI in Cassandra 3.5, the limitations belong to the pass. Now you can create performant indices on your columns as well as benefit from full text search capabilities with the introduction of the new `LIKE %term%` syntax. To illustrate how SASI works, we'll use a database of 100 000 albums and artists. We'll also show how SASI can help to accelerate analytics scenarios with Spark using SparkSQL predicate-pushdown"],"long":["Apache Cassandra is a scalable database with high availability features. But they come with severe limitations in term of querying capabilities. Since the introduction of SASI in Cassandra 3.5, the limitations belong to the pass. Now you can create performant indices on your columns as well as benefit from full text search capabilities with the introduction of the new `LIKE %term%` syntax. To illustrate how SASI works, we'll use a database of 100 000 albums and artists. We'll also show how SASI can help to accelerate analytics scenarios with Spark using SparkSQL predicate-pushdown"]}],"tags":["bigdata"]},{"firstname":"Jens","lastname":"Deters","pageurl":"jens-deters","url":"http://www.jensd.de/","photo":"Jens Deters.jpg","company":"Codecentric","talk":[{"tid":515,"title":"MQTT: The glue for the Internet of Things","type":"talk","short":["This session is about a real MQTT-driven IoT stack with several sensors, remote-controlled switches. Via a secured connection to a remote MQTT broker I will show how data measured by microcontroller driven sensors transmitted and then displayed by JavaFX based MQTT applications on different platforms (desktop, embedded and mobile devices) and custom NeoPixel driven gauges."],"long":["A full IoT stack with sensors, actors and (mobile) clients glued together by MQTT","The Internet of Things becomes more and more part of our life. A fast growing number of different kind of devices provide programming interfaces. The more heterogeneous these environments are, the more increases the need for consistant transmission and control protocols.","By end of the 1990s IBM invented the Message Queue Telemetry Transport called MQTT.","MQTT is a very lightweight, easy to use 'publish/subscribe' M2M / IoT communication protocol that rapidly gains importance in the IoT ecosystem.","This session is about a real MQTT-driven IoT stack with several sensors, remote-controlled switches. Via a secured connection to a remote MQTT broker I will show how data measured by microcontroller driven sensors transmitted and then displayed by JavaFX based MQTT applications on different platforms (desktop, embedded and mobile devices) and custom NeoPixel driven gauges.","Additionally I will introduce how to use MQTT.fx for testing, simulating, and debugging MQTT communications. MQTT.fx is a free desktop application available for Windwos, OS X and Linux.","Session schedule:","- Introduction of the IoT network architecture and the involved components","- Introduction of the MQTT protocol","- Overview of securing MQTT traffic","- Overview of the very active MQTT ecosystem","- Introducing MQTT.fx","- Live demo"]}],"tags":["iot"]},{"firstname":"Zoran","lastname":"Rončević","pageurl":"zoran-roncevic","url":"https://rs.linkedin.com/in/zoran-roncevic-a6049970","photo":"Zoran Roncevic.jpg","company":"\"Maker\" Association","talk":[{"tid":520,"title":"NodeJS i Python za IoT platforme","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":["iot","javascript"]},{"firstname":"Jakub","lastname":"Marchwicki","pageurl":"jakub-marchwicki","url":"http://jakub.marchwicki.pl/","photo":"Jakub Marchwicki.jpg","company":"","talk":[{"tid":525,"title":"Reverse engineering the clean code","type":"talk","short":["This might be the psychology basic for developers… starting with the design 101; take some design principles and show how they are reflected in code. "],"long":["This talk takes one of design principles (from UX world- Norman's design of everyday things, memory model, psychology of short term memory - etc) and extrapolate it onto programming world, trying to distill some patterns and antipatterns in developers' approach to code."]}],"tags":null},{"firstname":"Miloš","lastname":"Kresović","pageurl":"milos-kresovic","url":"","photo":"user.png","company":"New and rising","talk":[{"tid":530,"title":"MVVM with Android Databinding in Practice","type":"talk","short":["general concept of MVVM and Android Databinding - why they should be used together - how using these technologies reflects to the app architecture - code snippets from practice - disadvantages, cases when it shouldn't be used and alternatives "],"long":["general concept of MVVM and Android Databinding - why they should be used together - how using these technologies reflects to the app architecture - code snippets from practice - disadvantages, cases when it shouldn't be used and alternatives "]}],"tags":["android"]},{"firstname":"Stanko","lastname":"Krtalić Rusendić","pageurl":"stanko-krtalic-rusendic","url":"https://twitter.com/monorkin","photo":"Stanko Rusendic.jpg","company":"Infinum","talk":[{"tid":535,"title":"Stubs, Mocks & Spies","type":"talk","short":["1000 tests running for hours on continuous integration services should be a thing of the past. Don't lose time waiting for your tests. "],"long":["1000 tests running for hours on continuous integration services should be a thing of the past. Don't lose time waiting for your tests. "]}],"tags":["web","ruby"]},{"firstname":"Nenad","lastname":"Pavićević","pageurl":"nenad-pavicevic","url":"","photo":"user.png","company":"Novomatic Lottery Solutions","talk":[{"tid":540,"title":"Continuous Security Testing - Automating your AppSec Program","type":"talk","short":["TBA"],"long":["TBA"]}],"tags":null},{"firstname":"Predrag","lastname":"Kapamadzin","pageurl":"predrag-kapamadzin","url":"http://www.linkedin.com/in/predragkapamadzin","photo":"Predrag Kapamadzin.jpg","company":"Levi 9","talk":[{"tid":545,"title":"A Scrum Team – can it be great or is that a bait","type":"talk","short":["TBA"],"long":["TBA"],"secondspeaker":"Anamarija Petrović"}],"tags":null},{"firstname":"Anamarija","lastname":"Petrović","pageurl":"anamarija-petrovic","url":"https://rs.linkedin.com/in/anamarijapetrovic","photo":"Anamarija Petrovic.png","company":"Levi 9","talk":[{"tid":550,"title":"A Scrum Team – can it be great or is that a bait","type":"talk","short":["TBA"],"long":["TBA"],"secondspeaker":"Predrag Kapamadzin"}],"tags":null}]
